html/portfolio/472hw11.asm.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-06-10 Sat 14:16 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Ethan Smith" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div class="org-src-container">
<pre class="src src-asm"><span class="linenr">   1: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Title:          Analog signal decoder/transmitter and generator</span>
<span class="linenr">   2: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">   3: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Objective:      CMPEN 472 Homework 11</span>
<span class="linenr">   4: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">   5: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Revision:       V3.2  for CodeWarrior 5.2 Debugger Simulation</span>
<span class="linenr">   6: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">   7: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Date:           30 November 2022</span>
<span class="linenr">   8: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">   9: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Programmer:     Ethan Smith</span>
<span class="linenr">  10: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">  11: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Company:        The Pennsylvania State University</span>
<span class="linenr">  12: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">Department of Computer Science and Engineering</span>
<span class="linenr">  13: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">  14: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Program:        Generates waves (saw, triangle, and square), outputting them over serial.</span>
<span class="linenr">  15: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">a timer runs in the background</span>
<span class="linenr">  16: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">  17: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Algorithm:      Command line interface. The user is presented with a command</span>
<span class="linenr">  18: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">prompt on which they can type.</span>
<span class="linenr">  19: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">  20: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">when the user hits enter, their input is validated.</span>
<span class="linenr">  21: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">if the input is valid, then it is parsed and evaluated.</span>
<span class="linenr">  22: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">otherwise, the program returns an error.</span>
<span class="linenr">  23: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">  24: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">the clock is run using the RTI interrupt, which increments a counter.</span>
<span class="linenr">  25: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">this counter is checked periodically, and when it is 400 (set lower for</span>
<span class="linenr">  26: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">sim purposes), 1 second has elapsed, and the seconds/minutes counters are</span>
<span class="linenr">  27: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">also updated.</span>
<span class="linenr">  28: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">  29: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">the waves are generated using the oc5 interrupt. Depending on the type of wave</span>
<span class="linenr">  30: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">desired, there are 3 separate ISRs which will be set in the ISR jump vector when</span>
<span class="linenr">  31: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">the appropriate command is run.</span>
<span class="linenr">  32: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">  33: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">the ADC command creates another interrupt routine on oc5 which</span>
<span class="linenr">  34: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">reads from the ADC channel 7, and transmits the data to the</span>
<span class="linenr">  35: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">terminal</span>
<span class="linenr">  36: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">  37: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Register use:   Various usages depending on the subroutine.</span>
<span class="linenr">  38: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">typically, X is used as input buffer pointer.</span>
<span class="linenr">  39: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">D is typically used as the data pointer.</span>
<span class="linenr">  40: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">  41: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">each subroutine defines stack variables which are used throughout</span>
<span class="linenr">  42: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">the subroutine.</span>
<span class="linenr">  43: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">  44: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Memory use:     RAM Locations from $3000 for data,</span>
<span class="linenr">  45: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">RAM Locations after data for program</span>
<span class="linenr">  46: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">  47: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">RAM Locations from program to 4100 for SP</span>
<span class="linenr">  48: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">  49: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">  50: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Observation:    Clock which counts up and loops around to 0:00 after 9:59</span>
<span class="linenr">  51: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">can be set via tty s command.</span>
<span class="linenr">  52: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">  53: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">clock can be stopped with the quit command</span>
<span class="linenr">  54: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">  55: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">wave generator works as expected, with the caveat that the clock is slowed down</span>
<span class="linenr">  56: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">while the wave is being generated, because the simulator slows down while printing.</span>
<span class="linenr">  57: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">  58: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">adc command works as expected. ADC channel 7 is sampled at</span>
<span class="linenr">  59: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">8000Hz. it returns 2048 samples worth of data over the</span>
<span class="linenr">  60: </span><span style="color: #9ca0a4;">;;;                 </span><span style="color: #9ca0a4;">serial output.</span>
<span class="linenr">  61: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">  62: </span><span style="color: #9ca0a4;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="linenr">  63: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Parameter Declearation Section</span>
<span class="linenr">  64: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">  65: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Export Symbols</span>
<span class="linenr">  66: </span>            <span style="color: #e45649;">XDEF</span>        pstart       <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">export 'pstart' symbol</span>
<span class="linenr">  67: </span>            <span style="color: #e45649;">ABSENTRY</span>    pstart       <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">for assembly entry point</span>
<span class="linenr">  68: </span>
<span class="linenr">  69: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Symbols and Macros</span>
<span class="linenr">  70: </span><span style="color: #a626a4;">PORTA</span>       <span style="color: #e45649;">EQU</span>         $0000        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">i/o port A addresses</span>
<span class="linenr">  71: </span><span style="color: #a626a4;">DDRA</span>        <span style="color: #e45649;">EQU</span>         $0002
<span class="linenr">  72: </span><span style="color: #a626a4;">PORTB</span>       <span style="color: #e45649;">EQU</span>         $0001        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">i/o port B addresses</span>
<span class="linenr">  73: </span><span style="color: #a626a4;">DDRB</span>        <span style="color: #e45649;">EQU</span>         $0003
<span class="linenr">  74: </span>
<span class="linenr">  75: </span><span style="color: #a626a4;">SCIBDH</span>      <span style="color: #e45649;">EQU</span>         $00C8        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Serial port (SCI) Baud Register H</span>
<span class="linenr">  76: </span><span style="color: #a626a4;">SCIBDL</span>      <span style="color: #e45649;">EQU</span>         $00C9        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Serial port (SCI) Baud Register L</span>
<span class="linenr">  77: </span><span style="color: #a626a4;">SCICR2</span>      <span style="color: #e45649;">EQU</span>         $00CB        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Serial port (SCI) Control Register 2</span>
<span class="linenr">  78: </span><span style="color: #a626a4;">SCISR1</span>      <span style="color: #e45649;">EQU</span>         $00CC        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Serial port (SCI) Status Register 1</span>
<span class="linenr">  79: </span><span style="color: #a626a4;">SCIDRL</span>      <span style="color: #e45649;">EQU</span>         $00CF        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Serial port (SCI) Data Register</span>
<span class="linenr">  80: </span>
<span class="linenr">  81: </span><span style="color: #a626a4;">TIOS</span>        <span style="color: #e45649;">EQU</span>         $0040        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Timer Input Capture (IC) or Output Compare (OC) select</span>
<span class="linenr">  82: </span><span style="color: #a626a4;">TIE</span>         <span style="color: #e45649;">EQU</span>         $004C        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Timer interrupt enable register</span>
<span class="linenr">  83: </span><span style="color: #a626a4;">TCNTH</span>       <span style="color: #e45649;">EQU</span>         $0044        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Timer free runing main counter</span>
<span class="linenr">  84: </span><span style="color: #a626a4;">TSCR1</span>       <span style="color: #e45649;">EQU</span>         $0046        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Timer system control 1</span>
<span class="linenr">  85: </span><span style="color: #a626a4;">TSCR2</span>       <span style="color: #e45649;">EQU</span>         $004D        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Timer system control 2</span>
<span class="linenr">  86: </span><span style="color: #a626a4;">TFLG1</span>       <span style="color: #e45649;">EQU</span>         $004E        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Timer interrupt flag 1</span>
<span class="linenr">  87: </span><span style="color: #a626a4;">TC5H</span>        <span style="color: #e45649;">EQU</span>         $005A        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Timer channel 5 register</span>
<span class="linenr">  88: </span>
<span class="linenr">  89: </span><span style="color: #a626a4;">CRGFLG</span>      <span style="color: #e45649;">EQU</span>         $0037        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Clock and Reset Generator Flags</span>
<span class="linenr">  90: </span><span style="color: #a626a4;">CRGINT</span>      <span style="color: #e45649;">EQU</span>         $0038        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Clock and Reset Generator Interrupts</span>
<span class="linenr">  91: </span><span style="color: #a626a4;">RTICTL</span>      <span style="color: #e45649;">EQU</span>         $003B        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Real Time Interrupt Control</span>
<span class="linenr">  92: </span>
<span class="linenr">  93: </span><span style="color: #a626a4;">ATDCTL2</span>     <span style="color: #e45649;">EQU</span>  $0082               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Analog-to-Digital Converter (ADC) registers</span>
<span class="linenr">  94: </span><span style="color: #a626a4;">ATDCTL3</span>     <span style="color: #e45649;">EQU</span>  $0083
<span class="linenr">  95: </span><span style="color: #a626a4;">ATDCTL4</span>     <span style="color: #e45649;">EQU</span>  $0084
<span class="linenr">  96: </span><span style="color: #a626a4;">ATDCTL5</span>     <span style="color: #e45649;">EQU</span>  $0085
<span class="linenr">  97: </span><span style="color: #a626a4;">ATDSTAT0</span>    <span style="color: #e45649;">EQU</span>  $0086
<span class="linenr">  98: </span><span style="color: #a626a4;">ATDDR0H</span>     <span style="color: #e45649;">EQU</span>  $0090
<span class="linenr">  99: </span><span style="color: #a626a4;">ATDDR0L</span>     <span style="color: #e45649;">EQU</span>  $0091
<span class="linenr"> 100: </span><span style="color: #a626a4;">ATDDR7H</span>     <span style="color: #e45649;">EQU</span>  $009e
<span class="linenr"> 101: </span><span style="color: #a626a4;">ATDDR7L</span>     <span style="color: #e45649;">EQU</span>  $009f
<span class="linenr"> 102: </span>
<span class="linenr"> 103: </span><span style="color: #a626a4;">BS</span>          <span style="color: #e45649;">equ</span>         $08          <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">backspace character</span>
<span class="linenr"> 104: </span><span style="color: #a626a4;">CR</span>          <span style="color: #e45649;">equ</span>         $0d          <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">carriage return, ASCII 'Return' key</span>
<span class="linenr"> 105: </span><span style="color: #a626a4;">LF</span>          <span style="color: #e45649;">equ</span>         $0a          <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">line feed, ASCII 'next line' character</span>
<span class="linenr"> 106: </span><span style="color: #a626a4;">NULL</span>        <span style="color: #e45649;">equ</span>         $00          <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">null terminator</span>
<span class="linenr"> 107: </span>
<span class="linenr"> 108: </span><span style="color: #a626a4;">DATAmax</span>     <span style="color: #e45649;">equ</span>         <span style="color: #50a14f;">2048</span>         <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Data count maximum, 1024 constant</span>
<span class="linenr"> 109: </span><span style="color: #9ca0a4;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="linenr"> 110: </span>
<span class="linenr"> 111: </span><span style="color: #9ca0a4;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="linenr"> 112: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Interrupt Vector Section</span>
<span class="linenr"> 113: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">org     $3FF0               ; RTI interrupt vector setup for CSM-128 board</span>
<span class="linenr"> 114: </span>            <span style="color: #e45649;">org</span>     $FFF0               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">RTI interrupt vector setup for the simulator</span>
<span class="linenr"> 115: </span>            <span style="color: #e45649;">DC.W</span>    rtiisr              <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">place the address of the ISR at this location</span>
<span class="linenr"> 116: </span>
<span class="linenr"> 117: </span>            <span style="color: #e45649;">ORG</span>     $FFE4       <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Timer channel 5 interrupt vector setup, on simulator</span>
<span class="linenr"> 118: </span><span style="color: #a626a4;">oc5isr</span>      <span style="color: #e45649;">DC.W</span>    $0000
<span class="linenr"> 119: </span><span style="color: #9ca0a4;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="linenr"> 120: </span>
<span class="linenr"> 121: </span><span style="color: #9ca0a4;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="linenr"> 122: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Data Section: address used [ $3000 to $30FF ] RAM memory</span>
<span class="linenr"> 123: </span>            <span style="color: #e45649;">ORG</span>         $3000        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Reserved RAM memory starting address</span>
<span class="linenr"> 124: </span>                                     <span style="color: #9ca0a4;">;   </span><span style="color: #9ca0a4;">for Data for CMPEN 472 class</span>
<span class="linenr"> 125: </span>
<span class="linenr"> 126: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">convenience string for sending newlines to terminal</span>
<span class="linenr"> 127: </span><span style="color: #a626a4;">NEWLINE</span>     <span style="color: #e45649;">DC.B</span>         CR, LF, NULL
<span class="linenr"> 128: </span>
<span class="linenr"> 129: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">the menu which is printed when the program first starts</span>
<span class="linenr"> 130: </span><span style="color: #a626a4;">MENU</span>        <span style="color: #e45649;">DC.B</span>   <span style="color: #50a14f;">"Wave Generation Program"</span>, CR, LF
<span class="linenr"> 131: </span>            <span style="color: #e45649;">DC.B</span>   <span style="color: #50a14f;">"use 'gw' to generate a sawtooth wave"</span>, CR, LF
<span class="linenr"> 132: </span>            <span style="color: #e45649;">DC.B</span>   <span style="color: #50a14f;">"use 'gt' to generate a triangle wave"</span>, CR, LF
<span class="linenr"> 133: </span>            <span style="color: #e45649;">DC.B</span>   <span style="color: #50a14f;">"use 'gq' to generate a square wave"</span>, CR, LF
<span class="linenr"> 134: </span>            <span style="color: #e45649;">DC.B</span>   <span style="color: #50a14f;">"use 's M:SS' to set the current time"</span>, CR, LF
<span class="linenr"> 135: </span>            <span style="color: #e45649;">DC.B</span>   <span style="color: #50a14f;">"use 'q' to quit the program and stop the clock"</span>, CR, LF, NULL
<span class="linenr"> 136: </span>
<span class="linenr"> 137: </span><span style="color: #a626a4;">PROMPT</span>      <span style="color: #e45649;">DC.B</span>   <span style="color: #50a14f;">"HW11&gt; "</span>, NULL
<span class="linenr"> 138: </span><span style="color: #a626a4;">QUIT_MSG</span>    <span style="color: #e45649;">DC.B</span>   <span style="color: #50a14f;">"Stopping Clock..."</span>, CR, LF
<span class="linenr"> 139: </span>            <span style="color: #e45649;">DC.B</span>   <span style="color: #50a14f;">"Typewriter Program Started..."</span>, CR, LF, NULL
<span class="linenr"> 140: </span>
<span class="linenr"> 141: </span><span style="color: #a626a4;">BUFF_ERR</span>    <span style="color: #e45649;">DC.B</span>   <span style="color: #50a14f;">"Buffer Error"</span>, CR, LF, NULL
<span class="linenr"> 142: </span><span style="color: #a626a4;">FMT_ERR</span>     <span style="color: #e45649;">DC.B</span>   <span style="color: #50a14f;">"Format Error: proper format is 's M:SS'. M=[0,9] SS=[00,59]"</span>, CR, LF, NULL
<span class="linenr"> 143: </span><span style="color: #a626a4;">FMT_ERR2</span>    <span style="color: #e45649;">DC.B</span>   <span style="color: #50a14f;">"Format Error: you can only generate sawtooth (gw) triangle (gt) or square (gq) waves"</span>, CR, LF, NULL
<span class="linenr"> 144: </span><span style="color: #a626a4;">CMD_ERR</span>     <span style="color: #e45649;">DC.B</span>   <span style="color: #50a14f;">"Command Error: valid commands are"</span>, CR, LF
<span class="linenr"> 145: </span>            <span style="color: #e45649;">DC.B</span>   <span style="color: #50a14f;">"                            's'  : set time"</span>, CR, LF
<span class="linenr"> 146: </span>            <span style="color: #e45649;">DC.B</span>   <span style="color: #50a14f;">"                            'gw' : sawtooth wave generation"</span>, CR, LF
<span class="linenr"> 147: </span>            <span style="color: #e45649;">DC.B</span>   <span style="color: #50a14f;">"                            'qt' : triangle wave generation"</span>, CR, LF
<span class="linenr"> 148: </span>            <span style="color: #e45649;">DC.B</span>   <span style="color: #50a14f;">"                            'gq' : square wave generation"</span>, CR, LF
<span class="linenr"> 149: </span>            <span style="color: #e45649;">DC.B</span>   <span style="color: #50a14f;">"                            'adc': get and print analog wave"</span>, CR, LF
<span class="linenr"> 150: </span>            <span style="color: #e45649;">DC.B</span>   <span style="color: #50a14f;">"                            'q'  : quit"</span>, CR, LF, NULL
<span class="linenr"> 151: </span>
<span class="linenr"> 152: </span><span style="color: #a626a4;">msg3</span>        <span style="color: #e45649;">DC.B</span>   <span style="color: #50a14f;">"&gt; Be sure to start saving Terminal data: open Output file = RxData3.txt"</span>, CR, LF, NULL
<span class="linenr"> 153: </span><span style="color: #a626a4;">msg4</span>        <span style="color: #e45649;">DC.B</span>   <span style="color: #50a14f;">"&gt; press any key to continue..."</span>, CR, LF, CR, LF, NULL
<span class="linenr"> 154: </span><span style="color: #a626a4;">msg5</span>        <span style="color: #e45649;">DC.B</span>   <span style="color: #50a14f;">"&gt; Done!  Close Output file."</span>, CR, LF, NULL
<span class="linenr"> 155: </span><span style="color: #a626a4;">msg6</span>        <span style="color: #e45649;">DC.B</span>   <span style="color: #50a14f;">"&gt; Ready for next data transmission."</span>, CR, LF, NULL
<span class="linenr"> 156: </span>
<span class="linenr"> 157: </span><span style="color: #a626a4;">ctr125u</span>     <span style="color: #e45649;">DS.W</span>   <span style="color: #50a14f;">1</span>            <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">16bit interrupt counter for 125 uSec. of time</span>
<span class="linenr"> 158: </span>
<span class="linenr"> 159: </span><span style="color: #a626a4;">BUF</span>         <span style="color: #e45649;">DS.B</span>   <span style="color: #50a14f;">6</span>            <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">character buffer for a 16bit number in decimal ASCII</span>
<span class="linenr"> 160: </span><span style="color: #a626a4;">CTR</span>         <span style="color: #e45649;">DS.B</span>   <span style="color: #50a14f;">1</span>            <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">character buffer fill count</span>
<span class="linenr"> 161: </span>
<span class="linenr"> 162: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">ADC variables</span>
<span class="linenr"> 163: </span><span style="color: #a626a4;">ATDdone</span>     <span style="color: #e45649;">DS.B</span>   <span style="color: #50a14f;">1</span>
<span class="linenr"> 164: </span>
<span class="linenr"> 165: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">input and output string buffers</span>
<span class="linenr"> 166: </span><span style="color: #a626a4;">buffer</span>    <span style="color: #e45649;">DS</span>      <span style="color: #50a14f;">30</span>      <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">30 bytes for user input</span>
<span class="linenr"> 167: </span>
<span class="linenr"> 168: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">global variables for the current time</span>
<span class="linenr"> 169: </span><span style="color: #a626a4;">timem</span>       <span style="color: #e45649;">DS.B</span>    <span style="color: #50a14f;">1</span>           <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">minute</span>
<span class="linenr"> 170: </span><span style="color: #a626a4;">times</span>       <span style="color: #e45649;">DS.B</span>    <span style="color: #50a14f;">1</span>           <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">second</span>
<span class="linenr"> 171: </span>
<span class="linenr"> 172: </span><span style="color: #a626a4;">ctr2p5m</span>     <span style="color: #e45649;">DS.W</span>    <span style="color: #50a14f;">1</span>           <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">interrupt counter for 2.5msec</span>
<span class="linenr"> 173: </span><span style="color: #9ca0a4;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="linenr"> 174: </span>
<span class="linenr"> 175: </span>
<span class="linenr"> 176: </span><span style="color: #9ca0a4;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="linenr"> 177: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Program Section: address used [ end of DATA to $3FFF ] RAM memory</span>
<span class="linenr"> 178: </span>
<span class="linenr"> 179: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">char* buffer;</span>
<span class="linenr"> 180: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 181: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">while(true) {</span>
<span class="linenr"> 182: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">update_leds();</span>
<span class="linenr"> 183: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">print("Clock&gt; ");</span>
<span class="linenr"> 184: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">read_line(buffer);  // get user input</span>
<span class="linenr"> 185: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">eval_input(buffer); // send user input to eval subroutine</span>
<span class="linenr"> 186: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">}</span>
<span class="linenr"> 187: </span><span style="color: #a626a4;">pstart</span>
<span class="linenr"> 188: </span>    <span style="color: #e45649;">lds</span>     #$4100              <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">initialize stack pointer</span>
<span class="linenr"> 189: </span>
<span class="linenr"> 190: </span>    <span style="color: #e45649;">ldaa</span>    #<span style="color: #6a1868;">%11111111</span>          <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">set all PORTA/B bits as output</span>
<span class="linenr"> 191: </span>    <span style="color: #e45649;">staa</span>    DDRB                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 192: </span>    <span style="color: #e45649;">staa</span>    DDRA                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 193: </span>
<span class="linenr"> 194: </span>    <span style="color: #e45649;">ldaa</span>    #<span style="color: #6a1868;">%00000000</span>          <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">clear PORTA/B</span>
<span class="linenr"> 195: </span>    <span style="color: #e45649;">staa</span>    PORTB               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 196: </span>    <span style="color: #e45649;">staa</span>    PORTA               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 197: </span>
<span class="linenr"> 198: </span>    <span style="color: #e45649;">ldaa</span>    #$0C         <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Enable SCI port Tx and Rx units</span>
<span class="linenr"> 199: </span>    <span style="color: #e45649;">staa</span>    SCICR2       <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">disable SCI interrupts</span>
<span class="linenr"> 200: </span>
<span class="linenr"> 201: </span>    <span style="color: #e45649;">ldd</span>     #$0001       <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Set SCI Baud Register = $0001 =&gt; 1.5M baud at 24MHz (for simulation)</span>
<span class="linenr"> 202: </span><span style="color: #9ca0a4;">;   </span><span style="color: #9ca0a4;">ldd     #$0002       ; Set SCI Baud Register = $0002 =&gt; 750K baud at 24MHz</span>
<span class="linenr"> 203: </span><span style="color: #9ca0a4;">;   </span><span style="color: #9ca0a4;">ldd     #$000D       ; Set SCI Baud Register = $000D =&gt; 115200 baud at 24MHz</span>
<span class="linenr"> 204: </span><span style="color: #9ca0a4;">;   </span><span style="color: #9ca0a4;">ldd     #$009C       ; Set SCI Baud Register = $009C =&gt; 9600 baud at 24MHz</span>
<span class="linenr"> 205: </span>    <span style="color: #e45649;">std</span>     SCIBDH       <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">SCI port baud rate change</span>
<span class="linenr"> 206: </span>
<span class="linenr"> 207: </span>    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">RTI ISR configuration</span>
<span class="linenr"> 208: </span>    <span style="color: #e45649;">bset</span>   RTICTL,<span style="color: #6a1868;">%00011001</span> <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">set RTI: dev=10*(2**10)=2.555msec for C128 board</span>
<span class="linenr"> 209: </span>                            <span style="color: #9ca0a4;">;      </span><span style="color: #9ca0a4;">4MHz quartz oscillator clock</span>
<span class="linenr"> 210: </span>    <span style="color: #e45649;">bset</span>   CRGINT,<span style="color: #6a1868;">%10000000</span> <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">enable RTI interrupt</span>
<span class="linenr"> 211: </span>    <span style="color: #e45649;">bset</span>   CRGFLG,<span style="color: #6a1868;">%10000000</span> <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">clear RTI IF (Interrupt Flag)</span>
<span class="linenr"> 212: </span>
<span class="linenr"> 213: </span>    <span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">ATD initialization</span>
<span class="linenr"> 214: </span>    <span style="color: #e45649;">ldaa</span>    #<span style="color: #6a1868;">%11000000</span>       <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Turn ON ADC, clear flags, Disable ATD interrupt</span>
<span class="linenr"> 215: </span>    <span style="color: #e45649;">staa</span>    ATDCTL2
<span class="linenr"> 216: </span>    <span style="color: #e45649;">ldaa</span>    #<span style="color: #6a1868;">%00001000</span>       <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Single conversion per sequence, no FIFO</span>
<span class="linenr"> 217: </span>    <span style="color: #e45649;">staa</span>    ATDCTL3
<span class="linenr"> 218: </span>    <span style="color: #e45649;">ldaa</span>    #<span style="color: #6a1868;">%10000111</span>       <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">8bit, ADCLK=24MHz/16=1.5MHz, sampling time=2*(1/ADCLK)</span>
<span class="linenr"> 219: </span>    <span style="color: #e45649;">staa</span>    ATDCTL4          <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">for SIMULATION</span>
<span class="linenr"> 220: </span>
<span class="linenr"> 221: </span>    <span style="color: #e45649;">ldx</span>    #<span style="color: #50a14f;">0</span>
<span class="linenr"> 222: </span>    <span style="color: #e45649;">stx</span>    ctr2p5m          <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">initialize interrupt counter with 0.</span>
<span class="linenr"> 223: </span>    <span style="color: #e45649;">cli</span>                     <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">enable interrupt, global</span>
<span class="linenr"> 224: </span>
<span class="linenr"> 225: </span>    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">print the menu</span>
<span class="linenr"> 226: </span>    <span style="color: #e45649;">ldx</span>     #MENU
<span class="linenr"> 227: </span>    <span style="color: #e45649;">jsr</span>     print
<span class="linenr"> 228: </span>
<span class="linenr"> 229: </span>    <span style="color: #e45649;">ldx</span>     #PROMPT
<span class="linenr"> 230: </span>    <span style="color: #e45649;">jsr</span>     print
<span class="linenr"> 231: </span>
<span class="linenr"> 232: </span>    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">get user input and evaluate the command</span>
<span class="linenr"> 233: </span>    <span style="color: #e45649;">ldx</span>     #buffer             <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">load input_buffer</span>
<span class="linenr"> 234: </span>
<span class="linenr"> 235: </span><span style="color: #a626a4;">looop</span>
<span class="linenr"> 236: </span>    <span style="color: #e45649;">jsr</span>     update_LEDs      <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">make sure clock LEDs are updated</span>
<span class="linenr"> 237: </span>    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">prompt the user for a command</span>
<span class="linenr"> 238: </span>    <span style="color: #e45649;">jsr</span>     getchar             <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">type writer - check the key board</span>
<span class="linenr"> 239: </span>    <span style="color: #e45649;">cmpa</span>    #$00                <span style="color: #9ca0a4;">;  </span><span style="color: #9ca0a4;">if nothing typed, keep checking</span>
<span class="linenr"> 240: </span>    <span style="color: #e45649;">beq</span>     looop
<span class="linenr"> 241: </span>
<span class="linenr"> 242: </span>    <span style="color: #e45649;">cmpa</span>    #CR                 <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">was an enter typed?</span>
<span class="linenr"> 243: </span>    <span style="color: #e45649;">beq</span>     on_enter            <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 244: </span>
<span class="linenr"> 245: </span>    <span style="color: #e45649;">cmpa</span>    #BS                 <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">| was a backspace typed?</span>
<span class="linenr"> 246: </span>    <span style="color: #e45649;">beq</span>     on_backspace        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 247: </span>
<span class="linenr"> 248: </span>    <span style="color: #e45649;">cpx</span>     #buffer+<span style="color: #50a14f;">30</span>          <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">is there enough space in the input buffer?</span>
<span class="linenr"> 249: </span>    <span style="color: #e45649;">bls</span>     append              <span style="color: #9ca0a4;">;  </span><span style="color: #9ca0a4;">if yes, append input to input buffer</span>
<span class="linenr"> 250: </span>
<span class="linenr"> 251: </span>    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">there is not enough space in the buffer, clear it (by reseting X)</span>
<span class="linenr"> 252: </span>    <span style="color: #9ca0a4;">;;  </span><span style="color: #9ca0a4;">and report an error</span>
<span class="linenr"> 253: </span><span style="color: #a626a4;">clr_buf</span>
<span class="linenr"> 254: </span>    <span style="color: #e45649;">ldx</span>     #NEWLINE            <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">print a newline</span>
<span class="linenr"> 255: </span>    <span style="color: #e45649;">jsr</span>     print               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 256: </span>
<span class="linenr"> 257: </span>    <span style="color: #e45649;">ldx</span>     #BUFF_ERR           <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">print 'invalid command'</span>
<span class="linenr"> 258: </span>    <span style="color: #e45649;">jsr</span>     print               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 259: </span>
<span class="linenr"> 260: </span>    <span style="color: #e45649;">ldx</span>     #NEWLINE            <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">print a newline</span>
<span class="linenr"> 261: </span>    <span style="color: #e45649;">jsr</span>     print               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 262: </span>
<span class="linenr"> 263: </span>    <span style="color: #e45649;">ldx</span>     #PROMPT
<span class="linenr"> 264: </span>    <span style="color: #e45649;">jsr</span>     print
<span class="linenr"> 265: </span>
<span class="linenr"> 266: </span>    <span style="color: #e45649;">ldx</span>     #buffer             <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">reset input_buffer</span>
<span class="linenr"> 267: </span>    <span style="color: #e45649;">bra</span>     looop               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">re-enter loop</span>
<span class="linenr"> 268: </span>
<span class="linenr"> 269: </span>
<span class="linenr"> 270: </span><span style="color: #a626a4;">append</span>
<span class="linenr"> 271: </span>    <span style="color: #e45649;">staa</span>    <span style="color: #50a14f;">1</span>,X+                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">store the the typed character, and move the pointer</span>
<span class="linenr"> 272: </span>    <span style="color: #e45649;">clr</span>     X                   <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">null terminate</span>
<span class="linenr"> 273: </span>
<span class="linenr"> 274: </span>    <span style="color: #e45649;">jsr</span>     putchar             <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">display typed character in terminal</span>
<span class="linenr"> 275: </span>    <span style="color: #e45649;">bra</span>     looop               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">get next character</span>
<span class="linenr"> 276: </span>
<span class="linenr"> 277: </span><span style="color: #a626a4;">on_enter</span>
<span class="linenr"> 278: </span>    <span style="color: #e45649;">ldx</span>     #buffer             <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">set input for evaluate_cmd</span>
<span class="linenr"> 279: </span>
<span class="linenr"> 280: </span>    <span style="color: #e45649;">ldaa</span>    X                   <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">if the user just pressed enter, without typing anything</span>
<span class="linenr"> 281: </span>    <span style="color: #e45649;">cmpa</span>    #NULL               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">just print a new prompt (don't call evaluate)</span>
<span class="linenr"> 282: </span>    <span style="color: #e45649;">beq</span>     blank_line          <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 283: </span>
<span class="linenr"> 284: </span>    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">the user actually typed something</span>
<span class="linenr"> 285: </span>    <span style="color: #e45649;">jsr</span>     eval                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">check the command</span>
<span class="linenr"> 286: </span>
<span class="linenr"> 287: </span><span style="color: #a626a4;">blank_line</span>
<span class="linenr"> 288: </span>    <span style="color: #e45649;">ldx</span>     #NEWLINE            <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">print a newline</span>
<span class="linenr"> 289: </span>    <span style="color: #e45649;">jsr</span>     print               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 290: </span>
<span class="linenr"> 291: </span>    <span style="color: #e45649;">ldx</span>     #PROMPT
<span class="linenr"> 292: </span>    <span style="color: #e45649;">jsr</span>     print
<span class="linenr"> 293: </span>
<span class="linenr"> 294: </span>    <span style="color: #e45649;">ldx</span>     #buffer             <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">reset input_buffer</span>
<span class="linenr"> 295: </span>    <span style="color: #e45649;">clr</span>     X                   <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">NULL terminate beginning of input buffer to clear it.</span>
<span class="linenr"> 296: </span>
<span class="linenr"> 297: </span>    <span style="color: #e45649;">bra</span>     looop               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">get next command</span>
<span class="linenr"> 298: </span>
<span class="linenr"> 299: </span><span style="color: #a626a4;">on_backspace</span>
<span class="linenr"> 300: </span>    <span style="color: #e45649;">cpx</span>     #buffer             <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">ensure that there are characters to delete</span>
<span class="linenr"> 301: </span>    <span style="color: #e45649;">beq</span>     looop               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">if there is nothing in the buffer, return to looop</span>
<span class="linenr"> 302: </span>
<span class="linenr"> 303: </span>    <span style="color: #e45649;">clr</span>     <span style="color: #50a14f;">1</span>,-X                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">delete the last character, move pointer</span>
<span class="linenr"> 304: </span>    <span style="color: #e45649;">pshx</span>                        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">store this value on stack so we can use X to print stuff</span>
<span class="linenr"> 305: </span>
<span class="linenr"> 306: </span>    <span style="color: #e45649;">ldaa</span>    #LF                 <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">move cursor to beginning of line</span>
<span class="linenr"> 307: </span>    <span style="color: #e45649;">jsr</span>     putchar             <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 308: </span>
<span class="linenr"> 309: </span>    <span style="color: #e45649;">ldx</span>     #PROMPT             <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">print as new prompt</span>
<span class="linenr"> 310: </span>    <span style="color: #e45649;">jsr</span>     print               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 311: </span>
<span class="linenr"> 312: </span>    <span style="color: #e45649;">ldx</span>     #buffer             <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">print the input buffer</span>
<span class="linenr"> 313: </span>    <span style="color: #e45649;">jsr</span>     print               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 314: </span>
<span class="linenr"> 315: </span>    <span style="color: #e45649;">pulx</span>                        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">restore current location of cursor in buffer</span>
<span class="linenr"> 316: </span>
<span class="linenr"> 317: </span>    <span style="color: #e45649;">bra</span>     looop
<span class="linenr"> 318: </span>
<span class="linenr"> 319: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">subroutine section below</span>
<span class="linenr"> 320: </span>
<span class="linenr"> 321: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">eval</span>
<span class="linenr"> 322: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 323: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Program:    validates input and executes the command</span>
<span class="linenr"> 324: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 325: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Input:      X Register: buffer</span>
<span class="linenr"> 326: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 327: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Algorithm:</span>
<span class="linenr"> 328: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">checks if command is s or q. if not, then exit to command error.</span>
<span class="linenr"> 329: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 330: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">if command is s:</span>
<span class="linenr"> 331: </span><span style="color: #9ca0a4;">;;;         </span><span style="color: #9ca0a4;">is the rest of the command in this format: M:SS? (where M is [0,9], S is [00,59])</span>
<span class="linenr"> 332: </span><span style="color: #9ca0a4;">;;;         </span><span style="color: #9ca0a4;">if so, then set the minutes and seconds variables.</span>
<span class="linenr"> 333: </span><span style="color: #9ca0a4;">;;;         </span><span style="color: #9ca0a4;">else, exit format error.</span>
<span class="linenr"> 334: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 335: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">if command is q:</span>
<span class="linenr"> 336: </span><span style="color: #9ca0a4;">;;;         </span><span style="color: #9ca0a4;">check and make the buffer only contains q</span>
<span class="linenr"> 337: </span><span style="color: #9ca0a4;">;;;             </span><span style="color: #9ca0a4;">if not, exit command error</span>
<span class="linenr"> 338: </span><span style="color: #9ca0a4;">;;;             </span><span style="color: #9ca0a4;">else, print quit message, enter typewriter program</span>
<span class="linenr"> 339: </span><span style="color: #a626a4;">eval</span>
<span class="linenr"> 340: </span>    <span style="color: #e45649;">pshx</span>
<span class="linenr"> 341: </span>    <span style="color: #e45649;">pshy</span>
<span class="linenr"> 342: </span>    <span style="color: #e45649;">psha</span>
<span class="linenr"> 343: </span>
<span class="linenr"> 344: </span>    <span style="color: #e45649;">ldaa</span>    <span style="color: #50a14f;">1</span>,X+                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">A = command (every command is just one character)</span>
<span class="linenr"> 345: </span>    <span style="color: #e45649;">cmpa</span>    #'s'                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">does command == 's'?</span>
<span class="linenr"> 346: </span>    <span style="color: #e45649;">beq</span>     eval_set_time       <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">if so, validate and execute it.</span>
<span class="linenr"> 347: </span>
<span class="linenr"> 348: </span>    <span style="color: #e45649;">cmpa</span>    #'g'                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">does command == 'g'?</span>
<span class="linenr"> 349: </span>    <span style="color: #e45649;">beq</span>     eval_gen_sig        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">if so, validate and execute it.</span>
<span class="linenr"> 350: </span>
<span class="linenr"> 351: </span>    <span style="color: #e45649;">cmpa</span>    #'a'                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">does command == 'a'?</span>
<span class="linenr"> 352: </span>    <span style="color: #e45649;">lbeq</span>     eval_adc            <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">if so, see if it is 'adc'</span>
<span class="linenr"> 353: </span>
<span class="linenr"> 354: </span>    <span style="color: #e45649;">cmpa</span>    #'q'                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">does command == 'q'?</span>
<span class="linenr"> 355: </span>    <span style="color: #e45649;">lbeq</span>     eval_quit           <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">if so, validate and execute it.</span>
<span class="linenr"> 356: </span>
<span class="linenr"> 357: </span>    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">the command didn't match anything, so exit failure</span>
<span class="linenr"> 358: </span>    <span style="color: #e45649;">lbra</span>     eval_exit_cmd_error
<span class="linenr"> 359: </span>
<span class="linenr"> 360: </span><span style="color: #a626a4;">eval_set_time</span>
<span class="linenr"> 361: </span>    <span style="color: #e45649;">ldaa</span>    <span style="color: #50a14f;">1</span>,X+                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">is the input in the format of "s M:SS"?</span>
<span class="linenr"> 362: </span>    <span style="color: #e45649;">cmpa</span>    #' '                <span style="color: #9ca0a4;">;    </span><span style="color: #9ca0a4;">if not, jump to exit_error</span>
<span class="linenr"> 363: </span>    <span style="color: #e45649;">lbne</span>    eval_exit_error      <span style="color: #9ca0a4;">;    </span><span style="color: #9ca0a4;">else, continue</span>
<span class="linenr"> 364: </span>                                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 365: </span>    <span style="color: #e45649;">ldaa</span>    <span style="color: #50a14f;">1</span>,X+                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 366: </span>    <span style="color: #e45649;">jsr</span>     is_dig              <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 367: </span>    <span style="color: #e45649;">lbne</span>     eval_exit_error     <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 368: </span>                                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 369: </span>    <span style="color: #e45649;">ldaa</span>    <span style="color: #50a14f;">1</span>,X+                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 370: </span>    <span style="color: #e45649;">cmpa</span>    #':'                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 371: </span>    <span style="color: #e45649;">lbne</span>     eval_exit_error     <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 372: </span>                                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 373: </span>    <span style="color: #e45649;">ldaa</span>    <span style="color: #50a14f;">1</span>,X+                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 374: </span>    <span style="color: #e45649;">jsr</span>     is_dig              <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 375: </span>    <span style="color: #e45649;">lbne</span>     eval_exit_error     <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 376: </span>                                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 377: </span>    <span style="color: #e45649;">ldaa</span>    <span style="color: #50a14f;">1</span>,X+                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 378: </span>    <span style="color: #e45649;">jsr</span>     is_dig              <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 379: </span>    <span style="color: #e45649;">lbne</span>     eval_exit_error     <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 380: </span>                                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 381: </span>    <span style="color: #e45649;">ldaa</span>    <span style="color: #50a14f;">1</span>,X+                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 382: </span>    <span style="color: #e45649;">cmpa</span>    #NULL               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 383: </span>    <span style="color: #e45649;">lbne</span>     eval_exit_error     <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 384: </span>
<span class="linenr"> 385: </span>    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">at this point, we know the buffer is properly formatted</span>
<span class="linenr"> 386: </span>    <span style="color: #e45649;">ldx</span>     <span style="color: #50a14f;">3</span>,SP                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">reset buffer pointer</span>
<span class="linenr"> 387: </span>    <span style="color: #e45649;">leax</span>    <span style="color: #50a14f;">4</span>,X                 <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">load address of seconds number</span>
<span class="linenr"> 388: </span>    <span style="color: #e45649;">jsr</span>     atoi                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">convert number at address from ascii to integer</span>
<span class="linenr"> 389: </span>
<span class="linenr"> 390: </span>    <span style="color: #e45649;">cpd</span>     #<span style="color: #50a14f;">59</span>                 <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">if seconds &gt; 59 then:</span>
<span class="linenr"> 391: </span>    <span style="color: #e45649;">lbhi</span>     eval_exit_error     <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">invalid time input, exit error</span>
<span class="linenr"> 392: </span>
<span class="linenr"> 393: </span>    <span style="color: #e45649;">stab</span>    times               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">store lower 8 bits of output to seconds variable</span>
<span class="linenr"> 394: </span>
<span class="linenr"> 395: </span>    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">store the minutes now that we know the seconds are valid</span>
<span class="linenr"> 396: </span>    <span style="color: #e45649;">ldx</span>     <span style="color: #50a14f;">3</span>,SP                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">reset buffer pointer</span>
<span class="linenr"> 397: </span>    <span style="color: #e45649;">leax</span>    <span style="color: #50a14f;">2</span>,X                 <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">load address of first digit</span>
<span class="linenr"> 398: </span>    <span style="color: #e45649;">ldaa</span>    X                   <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">A = first digit</span>
<span class="linenr"> 399: </span>    <span style="color: #e45649;">suba</span>    #$30                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Convert A from ascii to integer</span>
<span class="linenr"> 400: </span>
<span class="linenr"> 401: </span>    <span style="color: #e45649;">staa</span>    timem               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">store to minutes variable</span>
<span class="linenr"> 402: </span>
<span class="linenr"> 403: </span>    <span style="color: #e45649;">lbra</span>     eval_exit           <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">exit subroutine</span>
<span class="linenr"> 404: </span>
<span class="linenr"> 405: </span><span style="color: #a626a4;">eval_gen_sig</span>
<span class="linenr"> 406: </span>    <span style="color: #e45649;">ldaa</span>    <span style="color: #50a14f;">1</span>,X+
<span class="linenr"> 407: </span>    <span style="color: #e45649;">cmpa</span>    #'w'
<span class="linenr"> 408: </span>    <span style="color: #e45649;">beq</span>     eval_sig_valid
<span class="linenr"> 409: </span>    <span style="color: #e45649;">cmpa</span>    #'t'
<span class="linenr"> 410: </span>    <span style="color: #e45649;">beq</span>     eval_sig_valid
<span class="linenr"> 411: </span>    <span style="color: #e45649;">cmpa</span>    #'q'
<span class="linenr"> 412: </span>    <span style="color: #e45649;">beq</span>     eval_sig_valid
<span class="linenr"> 413: </span>    <span style="color: #e45649;">lbra</span>    eval_exit_error2
<span class="linenr"> 414: </span>
<span class="linenr"> 415: </span><span style="color: #a626a4;">eval_sig_valid</span>
<span class="linenr"> 416: </span>    <span style="color: #e45649;">ldaa</span>    <span style="color: #50a14f;">1</span>,X-                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">move pointer back to the wave specifier</span>
<span class="linenr"> 417: </span>    <span style="color: #e45649;">cmpa</span>    #NULL
<span class="linenr"> 418: </span>    <span style="color: #e45649;">lbne</span>    eval_exit_error2    <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">exit error</span>
<span class="linenr"> 419: </span>    <span style="color: #e45649;">tfr</span>     X,Y                 <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">Move X to Y, so X can be used for print</span>
<span class="linenr"> 420: </span>
<span class="linenr"> 421: </span>    <span style="color: #e45649;">ldx</span>     #NEWLINE
<span class="linenr"> 422: </span>    <span style="color: #e45649;">jsr</span>     print
<span class="linenr"> 423: </span>    <span style="color: #e45649;">ldx</span>     #msg3
<span class="linenr"> 424: </span>    <span style="color: #e45649;">jsr</span>     print
<span class="linenr"> 425: </span>    <span style="color: #e45649;">ldx</span>     #msg4
<span class="linenr"> 426: </span>    <span style="color: #e45649;">jsr</span>     print
<span class="linenr"> 427: </span>
<span class="linenr"> 428: </span><span style="color: #a626a4;">eval_sig_get_key</span>
<span class="linenr"> 429: </span>    <span style="color: #e45649;">jsr</span>     update_LEDs
<span class="linenr"> 430: </span>    <span style="color: #e45649;">jsr</span>     getchar
<span class="linenr"> 431: </span>    <span style="color: #e45649;">cmpa</span>    #NULL
<span class="linenr"> 432: </span>    <span style="color: #e45649;">beq</span>     eval_sig_get_key
<span class="linenr"> 433: </span>
<span class="linenr"> 434: </span>    <span style="color: #e45649;">ldx</span>     #<span style="color: #50a14f;">0</span>                  <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">reset counter</span>
<span class="linenr"> 435: </span>    <span style="color: #e45649;">stx</span>     ctr125u
<span class="linenr"> 436: </span>
<span class="linenr"> 437: </span>    <span style="color: #e45649;">ldaa</span>    Y
<span class="linenr"> 438: </span>    <span style="color: #e45649;">jsr</span>     StartTimer5oc
<span class="linenr"> 439: </span>
<span class="linenr"> 440: </span><span style="color: #a626a4;">loop2048</span>
<span class="linenr"> 441: </span>    <span style="color: #e45649;">jsr</span>     update_LEDs      <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">make sure clock LEDs are updated</span>
<span class="linenr"> 442: </span>    <span style="color: #e45649;">ldd</span>     ctr125u
<span class="linenr"> 443: </span>    <span style="color: #e45649;">cpd</span>     #DATAmax         <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">1024 bytes will be sent, the receiver at Windows PC</span>
<span class="linenr"> 444: </span>    <span style="color: #e45649;">bhs</span>     loopTxON         <span style="color: #9ca0a4;">;   </span><span style="color: #9ca0a4;">will only take 2048 bytes.</span>
<span class="linenr"> 445: </span>    <span style="color: #e45649;">bra</span>     loop2048         <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">set Terminal Cache Size to 10000 lines, update from 1000 lines</span>
<span class="linenr"> 446: </span>
<span class="linenr"> 447: </span><span style="color: #a626a4;">loopTxON</span>
<span class="linenr"> 448: </span>    <span style="color: #e45649;">LDAA</span>    #<span style="color: #6a1868;">%00000000</span>
<span class="linenr"> 449: </span>    <span style="color: #e45649;">STAA</span>    TIE               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">disable OC5 interrupt</span>
<span class="linenr"> 450: </span>
<span class="linenr"> 451: </span>    <span style="color: #e45649;">ldx</span>     #NEWLINE
<span class="linenr"> 452: </span>    <span style="color: #e45649;">jsr</span>     print
<span class="linenr"> 453: </span>    <span style="color: #e45649;">jsr</span>     print
<span class="linenr"> 454: </span>
<span class="linenr"> 455: </span>    <span style="color: #e45649;">ldx</span>     #msg5            <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">print '&gt; Done!  Close Output file.'</span>
<span class="linenr"> 456: </span>    <span style="color: #e45649;">jsr</span>     print
<span class="linenr"> 457: </span>
<span class="linenr"> 458: </span>    <span style="color: #e45649;">ldx</span>     #msg6            <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">print '&gt; Ready for next data transmission'</span>
<span class="linenr"> 459: </span>    <span style="color: #e45649;">jsr</span>     print
<span class="linenr"> 460: </span>
<span class="linenr"> 461: </span>    <span style="color: #e45649;">ldx</span>     #NEWLINE
<span class="linenr"> 462: </span>    <span style="color: #e45649;">jsr</span>     print
<span class="linenr"> 463: </span>
<span class="linenr"> 464: </span>    <span style="color: #e45649;">bra</span>     eval_exit
<span class="linenr"> 465: </span>
<span class="linenr"> 466: </span><span style="color: #a626a4;">eval_adc</span>
<span class="linenr"> 467: </span>    <span style="color: #e45649;">ldaa</span>    <span style="color: #50a14f;">1</span>,X+
<span class="linenr"> 468: </span>    <span style="color: #e45649;">cmpa</span>    #'d'
<span class="linenr"> 469: </span>    <span style="color: #e45649;">bne</span>     eval_exit_cmd_error
<span class="linenr"> 470: </span>
<span class="linenr"> 471: </span>    <span style="color: #e45649;">ldaa</span>    <span style="color: #50a14f;">1</span>,X+
<span class="linenr"> 472: </span>    <span style="color: #e45649;">cmpa</span>    #'c'
<span class="linenr"> 473: </span>    <span style="color: #e45649;">bne</span>     eval_exit_cmd_error
<span class="linenr"> 474: </span>
<span class="linenr"> 475: </span>    <span style="color: #e45649;">ldaa</span>    <span style="color: #50a14f;">1</span>,X+
<span class="linenr"> 476: </span>    <span style="color: #e45649;">cmpa</span>    #NULL
<span class="linenr"> 477: </span>    <span style="color: #e45649;">bne</span>     eval_exit_cmd_error
<span class="linenr"> 478: </span>
<span class="linenr"> 479: </span>    <span style="color: #e45649;">ldx</span>     #NEWLINE
<span class="linenr"> 480: </span>    <span style="color: #e45649;">jsr</span>     print
<span class="linenr"> 481: </span>    <span style="color: #e45649;">jsr</span>     print
<span class="linenr"> 482: </span>
<span class="linenr"> 483: </span><span style="color: #a626a4;">eval_adc_get_key</span>
<span class="linenr"> 484: </span>    <span style="color: #e45649;">jsr</span>     update_LEDs
<span class="linenr"> 485: </span>    <span style="color: #e45649;">jsr</span>     getchar
<span class="linenr"> 486: </span>    <span style="color: #e45649;">cmpa</span>    #NULL
<span class="linenr"> 487: </span>    <span style="color: #e45649;">beq</span>     eval_adc_get_key
<span class="linenr"> 488: </span>
<span class="linenr"> 489: </span>    <span style="color: #e45649;">ldx</span>     #<span style="color: #50a14f;">0</span>                  <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">reset counter</span>
<span class="linenr"> 490: </span>    <span style="color: #e45649;">stx</span>     ctr125u
<span class="linenr"> 491: </span>
<span class="linenr"> 492: </span>    <span style="color: #e45649;">ldx</span>     #NEWLINE
<span class="linenr"> 493: </span>    <span style="color: #e45649;">jsr</span>     print
<span class="linenr"> 494: </span>
<span class="linenr"> 495: </span>    <span style="color: #e45649;">ldaa</span>    #'a'
<span class="linenr"> 496: </span>    <span style="color: #e45649;">jsr</span>     StartTimer5oc
<span class="linenr"> 497: </span>    <span style="color: #e45649;">bra</span>     loop2048
<span class="linenr"> 498: </span>
<span class="linenr"> 499: </span><span style="color: #a626a4;">eval_quit</span>
<span class="linenr"> 500: </span>    <span style="color: #e45649;">ldaa</span>    X
<span class="linenr"> 501: </span>    <span style="color: #e45649;">cmpa</span>    #NULL
<span class="linenr"> 502: </span>    <span style="color: #e45649;">bne</span>     eval_exit_cmd_error
<span class="linenr"> 503: </span>
<span class="linenr"> 504: </span>    <span style="color: #e45649;">sei</span>                         <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">disable interrupts, thus stopping the clock</span>
<span class="linenr"> 505: </span>
<span class="linenr"> 506: </span>    <span style="color: #e45649;">ldx</span>     #NEWLINE            <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">print quit message</span>
<span class="linenr"> 507: </span>    <span style="color: #e45649;">jsr</span>     print               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 508: </span>    <span style="color: #e45649;">ldx</span>     #QUIT_MSG           <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 509: </span>    <span style="color: #e45649;">jsr</span>     print               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 510: </span>
<span class="linenr"> 511: </span>    <span style="color: #e45649;">jsr</span>     typewriter          <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">enter typewriter program</span>
<span class="linenr"> 512: </span>
<span class="linenr"> 513: </span><span style="color: #a626a4;">eval_exit_error</span>
<span class="linenr"> 514: </span>    <span style="color: #e45649;">ldx</span>     #NEWLINE            <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">print a newline, then the error message</span>
<span class="linenr"> 515: </span>    <span style="color: #e45649;">jsr</span>     print               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 516: </span>    <span style="color: #e45649;">ldx</span>     #FMT_ERR            <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 517: </span>    <span style="color: #e45649;">jsr</span>     print               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 518: </span>    <span style="color: #e45649;">bra</span>     eval_exit           <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 519: </span>
<span class="linenr"> 520: </span><span style="color: #a626a4;">eval_exit_error2</span>
<span class="linenr"> 521: </span>    <span style="color: #e45649;">ldx</span>     #NEWLINE            <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">print a newline, then the error message</span>
<span class="linenr"> 522: </span>    <span style="color: #e45649;">jsr</span>     print               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 523: </span>    <span style="color: #e45649;">ldx</span>     #FMT_ERR2           <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 524: </span>    <span style="color: #e45649;">jsr</span>     print               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 525: </span>    <span style="color: #e45649;">bra</span>     eval_exit           <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 526: </span>
<span class="linenr"> 527: </span><span style="color: #a626a4;">eval_exit_cmd_error</span>
<span class="linenr"> 528: </span>    <span style="color: #e45649;">ldx</span>     #NEWLINE            <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">print a newline, then the error message</span>
<span class="linenr"> 529: </span>    <span style="color: #e45649;">jsr</span>     print               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 530: </span>    <span style="color: #e45649;">ldx</span>     #CMD_ERR            <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 531: </span>    <span style="color: #e45649;">jsr</span>     print               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 532: </span>
<span class="linenr"> 533: </span><span style="color: #a626a4;">eval_exit</span>
<span class="linenr"> 534: </span>    <span style="color: #e45649;">pula</span>
<span class="linenr"> 535: </span>    <span style="color: #e45649;">puly</span>
<span class="linenr"> 536: </span>    <span style="color: #e45649;">pulx</span>
<span class="linenr"> 537: </span>
<span class="linenr"> 538: </span>    <span style="color: #e45649;">rts</span>
<span class="linenr"> 539: </span><span style="color: #9ca0a4;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="linenr"> 540: </span>
<span class="linenr"> 541: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">***********Timer OC5 interrupt service routine***************</span>
<span class="linenr"> 542: </span><span style="color: #a626a4;">oc5isr_saw</span>
<span class="linenr"> 543: </span>    <span style="color: #e45649;">ldd</span>     #<span style="color: #50a14f;">3000</span>              <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">125usec with (24MHz/1 clock)</span>
<span class="linenr"> 544: </span>    <span style="color: #e45649;">addd</span>    TC5H               <span style="color: #9ca0a4;">;    </span><span style="color: #9ca0a4;">for next interrupt</span>
<span class="linenr"> 545: </span>    <span style="color: #e45649;">std</span>     TC5H               <span style="color: #9ca0a4;">;</span>
<span class="linenr"> 546: </span>    <span style="color: #e45649;">bset</span>    TFLG1,<span style="color: #6a1868;">%00100000</span>    <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">clear timer CH6 interrupt flag, not needed if fast clear enabled</span>
<span class="linenr"> 547: </span>    <span style="color: #e45649;">ldd</span>     ctr125u
<span class="linenr"> 548: </span>    <span style="color: #e45649;">ldx</span>     ctr125u
<span class="linenr"> 549: </span>    <span style="color: #e45649;">inx</span>                        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">update OC5 (125usec) interrupt counter</span>
<span class="linenr"> 550: </span>    <span style="color: #e45649;">stx</span>     ctr125u
<span class="linenr"> 551: </span>    <span style="color: #e45649;">clra</span>                       <span style="color: #9ca0a4;">;   </span><span style="color: #9ca0a4;">print ctr125u, only the last byte</span>
<span class="linenr"> 552: </span>    <span style="color: #e45649;">jsr</span>     pnum10             <span style="color: #9ca0a4;">;   </span><span style="color: #9ca0a4;">to make the file RxData3.txt with exactly 1024 data</span>
<span class="linenr"> 553: </span>    <span style="color: #e45649;">RTI</span>
<span class="linenr"> 554: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">***********end of Timer OC5 interrupt service routine********</span>
<span class="linenr"> 555: </span>
<span class="linenr"> 556: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">Timer OC5 interrupt service routine***************</span>
<span class="linenr"> 557: </span><span style="color: #a626a4;">oc5isr_tri</span>
<span class="linenr"> 558: </span>    <span style="color: #e45649;">ldd</span>     #<span style="color: #50a14f;">3000</span>              <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">125usec with (24MHz/1 clock)</span>
<span class="linenr"> 559: </span>    <span style="color: #e45649;">addd</span>    TC5H               <span style="color: #9ca0a4;">;    </span><span style="color: #9ca0a4;">for next interrupt</span>
<span class="linenr"> 560: </span>    <span style="color: #e45649;">std</span>     TC5H               <span style="color: #9ca0a4;">;</span>
<span class="linenr"> 561: </span>    <span style="color: #e45649;">bset</span>    TFLG1,<span style="color: #6a1868;">%00100000</span>    <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">clear timer CH6 interrupt flag, not needed if fast clear enabled</span>
<span class="linenr"> 562: </span>    <span style="color: #e45649;">ldd</span>     ctr125u
<span class="linenr"> 563: </span>    <span style="color: #e45649;">ldx</span>     ctr125u
<span class="linenr"> 564: </span>    <span style="color: #e45649;">inx</span>                        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">update OC5 (125usec) interrupt counter</span>
<span class="linenr"> 565: </span>    <span style="color: #e45649;">stx</span>     ctr125u
<span class="linenr"> 566: </span>
<span class="linenr"> 567: </span>
<span class="linenr"> 568: </span>    <span style="color: #e45649;">anda</span>    #<span style="color: #6a1868;">%00000001</span>          <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">if lsb is 1, countdown</span>
<span class="linenr"> 569: </span>    <span style="color: #e45649;">bne</span>     tri_countdown       <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">else, countup</span>
<span class="linenr"> 570: </span>    <span style="color: #e45649;">bra</span>     tri_countup
<span class="linenr"> 571: </span>
<span class="linenr"> 572: </span><span style="color: #a626a4;">tri_countdown</span>
<span class="linenr"> 573: </span>    <span style="color: #e45649;">ldaa</span>    #$FF                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">do 255 - B</span>
<span class="linenr"> 574: </span>    <span style="color: #e45649;">sba</span>                         <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">result is stored in A,</span>
<span class="linenr"> 575: </span>    <span style="color: #e45649;">tab</span>                         <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">so move it to B</span>
<span class="linenr"> 576: </span>    <span style="color: #e45649;">bra</span>     tri_exit
<span class="linenr"> 577: </span>
<span class="linenr"> 578: </span><span style="color: #a626a4;">tri_countup</span>
<span class="linenr"> 579: </span>
<span class="linenr"> 580: </span><span style="color: #a626a4;">tri_exit</span>
<span class="linenr"> 581: </span>    <span style="color: #e45649;">clra</span>
<span class="linenr"> 582: </span>    <span style="color: #e45649;">jsr</span>   pnum10             <span style="color: #9ca0a4;">;   </span><span style="color: #9ca0a4;">to make the file RxData3.txt with exactly 1024 data</span>
<span class="linenr"> 583: </span>    <span style="color: #e45649;">rti</span>
<span class="linenr"> 584: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">***********end of Timer OC5 interrupt service routine********</span>
<span class="linenr"> 585: </span>
<span class="linenr"> 586: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">Timer OC5 interrupt service routine***************</span>
<span class="linenr"> 587: </span><span style="color: #a626a4;">oc5isr_square</span>
<span class="linenr"> 588: </span>    <span style="color: #e45649;">ldd</span>     #<span style="color: #50a14f;">3000</span>              <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">125usec with (24MHz/1 clock)</span>
<span class="linenr"> 589: </span>    <span style="color: #e45649;">addd</span>    TC5H               <span style="color: #9ca0a4;">;    </span><span style="color: #9ca0a4;">for next interrupt</span>
<span class="linenr"> 590: </span>    <span style="color: #e45649;">std</span>     TC5H               <span style="color: #9ca0a4;">;</span>
<span class="linenr"> 591: </span>    <span style="color: #e45649;">bset</span>    TFLG1,<span style="color: #6a1868;">%00100000</span>    <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">clear timer CH6 interrupt flag, not needed if fast clear enabled</span>
<span class="linenr"> 592: </span>    <span style="color: #e45649;">ldd</span>     ctr125u
<span class="linenr"> 593: </span>    <span style="color: #e45649;">ldx</span>     ctr125u
<span class="linenr"> 594: </span>    <span style="color: #e45649;">inx</span>                        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">update OC5 (125usec) interrupt counter</span>
<span class="linenr"> 595: </span>    <span style="color: #e45649;">stx</span>     ctr125u
<span class="linenr"> 596: </span>
<span class="linenr"> 597: </span>    <span style="color: #e45649;">anda</span>    #<span style="color: #6a1868;">%00000001</span>          <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">if lsb is 1, hi</span>
<span class="linenr"> 598: </span>    <span style="color: #e45649;">bne</span>     square_hi           <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">else, low</span>
<span class="linenr"> 599: </span>    <span style="color: #e45649;">bra</span>     square_lo
<span class="linenr"> 600: </span>
<span class="linenr"> 601: </span><span style="color: #a626a4;">square_hi</span>
<span class="linenr"> 602: </span>    <span style="color: #e45649;">ldab</span>    #$FF
<span class="linenr"> 603: </span>    <span style="color: #e45649;">bra</span>     square_exit
<span class="linenr"> 604: </span><span style="color: #a626a4;">square_lo</span>
<span class="linenr"> 605: </span>    <span style="color: #e45649;">ldab</span>    #<span style="color: #50a14f;">0</span>
<span class="linenr"> 606: </span>
<span class="linenr"> 607: </span><span style="color: #a626a4;">square_exit</span>
<span class="linenr"> 608: </span>    <span style="color: #e45649;">clra</span>                     <span style="color: #9ca0a4;">;   </span><span style="color: #9ca0a4;">print ctr125u, only the last byte</span>
<span class="linenr"> 609: </span>    <span style="color: #e45649;">jsr</span>     pnum10             <span style="color: #9ca0a4;">;   </span><span style="color: #9ca0a4;">to make the file RxData3.txt with exactly 1024 data</span>
<span class="linenr"> 610: </span>    <span style="color: #e45649;">RTI</span>
<span class="linenr"> 611: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">***********end of Timer OC5 interrupt service routine********</span>
<span class="linenr"> 612: </span>
<span class="linenr"> 613: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">Timer OC5 interrupt service routine***************</span>
<span class="linenr"> 614: </span><span style="color: #a626a4;">oc5isr_adc</span>
<span class="linenr"> 615: </span>    <span style="color: #e45649;">ldd</span>     #<span style="color: #50a14f;">3000</span>              <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">125usec with (24MHz/1 clock)</span>
<span class="linenr"> 616: </span>    <span style="color: #e45649;">addd</span>    TC5H               <span style="color: #9ca0a4;">;    </span><span style="color: #9ca0a4;">for next interrupt</span>
<span class="linenr"> 617: </span>    <span style="color: #e45649;">std</span>     TC5H               <span style="color: #9ca0a4;">;</span>
<span class="linenr"> 618: </span>    <span style="color: #e45649;">bset</span>    TFLG1,<span style="color: #6a1868;">%00100000</span>    <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">clear timer CH6 interrupt flag, not needed if fast clear enabled</span>
<span class="linenr"> 619: </span>    <span style="color: #e45649;">ldx</span>     ctr125u
<span class="linenr"> 620: </span>    <span style="color: #e45649;">inx</span>                        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">update OC5 (125usec) interrupt counter</span>
<span class="linenr"> 621: </span>    <span style="color: #e45649;">stx</span>     ctr125u
<span class="linenr"> 622: </span>
<span class="linenr"> 623: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">adcwait</span>
<span class="linenr"> 624: </span><span style="color: #9ca0a4;">;    </span><span style="color: #9ca0a4;">ldaa    ATDSTAT0            ; if necessary, wait until conversion is done.</span>
<span class="linenr"> 625: </span><span style="color: #9ca0a4;">;    </span><span style="color: #9ca0a4;">anda    #%10000000</span>
<span class="linenr"> 626: </span><span style="color: #9ca0a4;">;    </span><span style="color: #9ca0a4;">beq     adcwait</span>
<span class="linenr"> 627: </span>
<span class="linenr"> 628: </span>    <span style="color: #e45649;">ldab</span>    ATDDR0L            <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">get number from adc</span>
<span class="linenr"> 629: </span>    <span style="color: #e45649;">clra</span>
<span class="linenr"> 630: </span>    <span style="color: #e45649;">jsr</span>     pnum10             <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">print number from adc</span>
<span class="linenr"> 631: </span>
<span class="linenr"> 632: </span>    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">start another conversion</span>
<span class="linenr"> 633: </span>    <span style="color: #e45649;">ldaa</span>    #<span style="color: #6a1868;">%10000111</span>       <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">right justified, unsigned, single conversion,</span>
<span class="linenr"> 634: </span>    <span style="color: #e45649;">staa</span>    ATDCTL5          <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">single channel, CHANNEL 7, start the conversion</span>
<span class="linenr"> 635: </span>    <span style="color: #e45649;">RTI</span>
<span class="linenr"> 636: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">***********end of Timer OC5 interrupt service routine********</span>
<span class="linenr"> 637: </span>
<span class="linenr"> 638: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">***************StartTimer5oc************************</span>
<span class="linenr"> 639: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Program: Start the timer interrupt, timer channel 6 output compare</span>
<span class="linenr"> 640: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Input:   A Register: ascii code for type of signal</span>
<span class="linenr"> 641: </span><span style="color: #9ca0a4;">;           </span><span style="color: #9ca0a4;">Constants - channel 6 output compare, 125usec at 24MHz</span>
<span class="linenr"> 642: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Output:  None, only the timer interrupt</span>
<span class="linenr"> 643: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Registers modified: D used and CCR modified</span>
<span class="linenr"> 644: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Algorithm:</span>
<span class="linenr"> 645: </span><span style="color: #9ca0a4;">;             </span><span style="color: #9ca0a4;">initialize TIOS, TIE, TSCR1, TSCR2, TC2H, and TFLG1</span>
<span class="linenr"> 646: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">**********************************************</span>
<span class="linenr"> 647: </span><span style="color: #a626a4;">StartTimer5oc</span>
<span class="linenr"> 648: </span>    <span style="color: #e45649;">pshd</span>
<span class="linenr"> 649: </span>    <span style="color: #e45649;">pshx</span>
<span class="linenr"> 650: </span>
<span class="linenr"> 651: </span>    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">set appropriate interrupt vector</span>
<span class="linenr"> 652: </span>    <span style="color: #e45649;">cmpa</span>    #'w'
<span class="linenr"> 653: </span>    <span style="color: #e45649;">beq</span>     saw5oc
<span class="linenr"> 654: </span>    <span style="color: #e45649;">cmpa</span>    #'t'
<span class="linenr"> 655: </span>    <span style="color: #e45649;">beq</span>     triangle5oc
<span class="linenr"> 656: </span>    <span style="color: #e45649;">cmpa</span>    #'q'
<span class="linenr"> 657: </span>    <span style="color: #e45649;">beq</span>     square5oc
<span class="linenr"> 658: </span>    <span style="color: #e45649;">cmpa</span>    #'a'
<span class="linenr"> 659: </span>    <span style="color: #e45649;">beq</span>     adc5oc
<span class="linenr"> 660: </span>
<span class="linenr"> 661: </span><span style="color: #a626a4;">saw5oc</span>
<span class="linenr"> 662: </span>    <span style="color: #e45649;">ldx</span>     #oc5isr_saw
<span class="linenr"> 663: </span>    <span style="color: #e45649;">bra</span>     store5oc
<span class="linenr"> 664: </span><span style="color: #a626a4;">triangle5oc</span>
<span class="linenr"> 665: </span>    <span style="color: #e45649;">ldx</span>     #oc5isr_tri
<span class="linenr"> 666: </span>    <span style="color: #e45649;">bra</span>     store5oc
<span class="linenr"> 667: </span><span style="color: #a626a4;">square5oc</span>
<span class="linenr"> 668: </span>    <span style="color: #e45649;">ldx</span>     #oc5isr_square
<span class="linenr"> 669: </span>    <span style="color: #e45649;">bra</span>     store5oc
<span class="linenr"> 670: </span><span style="color: #a626a4;">adc5oc</span>
<span class="linenr"> 671: </span>    <span style="color: #e45649;">ldx</span>     #oc5isr_adc
<span class="linenr"> 672: </span>
<span class="linenr"> 673: </span>
<span class="linenr"> 674: </span><span style="color: #a626a4;">store5oc</span>
<span class="linenr"> 675: </span>    <span style="color: #e45649;">stx</span>     oc5isr
<span class="linenr"> 676: </span>
<span class="linenr"> 677: </span>    <span style="color: #e45649;">ldaa</span>    #<span style="color: #6a1868;">%00100000</span>
<span class="linenr"> 678: </span>    <span style="color: #e45649;">staa</span>    TIOS              <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">set CH5 Output Compare</span>
<span class="linenr"> 679: </span>    <span style="color: #e45649;">staa</span>    TIE               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">set CH5 interrupt Enable</span>
<span class="linenr"> 680: </span>    <span style="color: #e45649;">ldaa</span>    #<span style="color: #6a1868;">%10000000</span>        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">enable timer, Fast Flag Clear not set</span>
<span class="linenr"> 681: </span>    <span style="color: #e45649;">staa</span>    TSCR1
<span class="linenr"> 682: </span>    <span style="color: #e45649;">ldaa</span>    #<span style="color: #6a1868;">%00000000</span>        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">TOI Off, TCRE Off, TCLK = BCLK/1</span>
<span class="linenr"> 683: </span>    <span style="color: #e45649;">staa</span>    TSCR2             <span style="color: #9ca0a4;">;   </span><span style="color: #9ca0a4;">not needed if started from reset</span>
<span class="linenr"> 684: </span>
<span class="linenr"> 685: </span>    <span style="color: #e45649;">ldd</span>     #<span style="color: #50a14f;">3000</span>            <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">125usec with (24MHz/1 clock)</span>
<span class="linenr"> 686: </span>    <span style="color: #e45649;">addd</span>    TCNTH            <span style="color: #9ca0a4;">;    </span><span style="color: #9ca0a4;">for first interrupt</span>
<span class="linenr"> 687: </span>    <span style="color: #e45649;">std</span>     TC5H             <span style="color: #9ca0a4;">;</span>
<span class="linenr"> 688: </span>
<span class="linenr"> 689: </span>    <span style="color: #e45649;">bset</span>    TFLG1,<span style="color: #6a1868;">%00100000</span>   <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">initial Timer CH5 interrupt flag Clear, not needed if fast clear set</span>
<span class="linenr"> 690: </span>    <span style="color: #e45649;">ldaa</span>    #<span style="color: #6a1868;">%00100000</span>
<span class="linenr"> 691: </span>    <span style="color: #e45649;">staa</span>    TIE               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">set CH5 interrupt Enable</span>
<span class="linenr"> 692: </span>
<span class="linenr"> 693: </span>    <span style="color: #e45649;">pulx</span>
<span class="linenr"> 694: </span>    <span style="color: #e45649;">puld</span>
<span class="linenr"> 695: </span>    <span style="color: #e45649;">rts</span>
<span class="linenr"> 696: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">***************end of StartTimer2oc*****************</span>
<span class="linenr"> 697: </span>
<span class="linenr"> 698: </span>
<span class="linenr"> 699: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">***********pnum10***************************</span>
<span class="linenr"> 700: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Program: print a word (16bit) in decimal to SCI port</span>
<span class="linenr"> 701: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Input:   Register D contains a 16 bit number to print in decimal number</span>
<span class="linenr"> 702: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Output:  decimal number printed on the terminal connected to SCI port</span>
<span class="linenr"> 703: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">*</span>
<span class="linenr"> 704: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Registers modified: CCR</span>
<span class="linenr"> 705: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">* Algorithm:</span>
<span class="linenr"> 706: </span><span style="color: #9ca0a4;">;     </span><span style="color: #9ca0a4;">Keep divide number by 10 and keep the remainders</span>
<span class="linenr"> 707: </span><span style="color: #9ca0a4;">;     </span><span style="color: #9ca0a4;">Then send it out to SCI port</span>
<span class="linenr"> 708: </span><span style="color: #9ca0a4;">;  </span><span style="color: #9ca0a4;">Need memory location for counter CTR and buffer BUF(6 byte max)</span>
<span class="linenr"> 709: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">**********************************************</span>
<span class="linenr"> 710: </span><span style="color: #a626a4;">pnum10</span>          <span style="color: #e45649;">pshd</span>                   <span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">Save registers</span>
<span class="linenr"> 711: </span>                <span style="color: #e45649;">pshx</span>
<span class="linenr"> 712: </span>                <span style="color: #e45649;">pshy</span>
<span class="linenr"> 713: </span>                <span style="color: #e45649;">clr</span>     CTR            <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">clear character count of an 8 bit number</span>
<span class="linenr"> 714: </span>
<span class="linenr"> 715: </span>                <span style="color: #e45649;">ldy</span>     #BUF
<span class="linenr"> 716: </span><span style="color: #a626a4;">pnum10p1</span>        <span style="color: #e45649;">ldx</span>     #<span style="color: #50a14f;">10</span>
<span class="linenr"> 717: </span>                <span style="color: #e45649;">idiv</span>
<span class="linenr"> 718: </span>                <span style="color: #e45649;">beq</span>     pnum10p2
<span class="linenr"> 719: </span>                <span style="color: #e45649;">stab</span>    <span style="color: #50a14f;">1</span>,y+
<span class="linenr"> 720: </span>                <span style="color: #e45649;">inc</span>     CTR
<span class="linenr"> 721: </span>                <span style="color: #e45649;">tfr</span>     x,d
<span class="linenr"> 722: </span>                <span style="color: #e45649;">bra</span>     pnum10p1
<span class="linenr"> 723: </span>
<span class="linenr"> 724: </span><span style="color: #a626a4;">pnum10p2</span>        <span style="color: #e45649;">stab</span>    <span style="color: #50a14f;">1</span>,y+
<span class="linenr"> 725: </span>                <span style="color: #e45649;">inc</span>     CTR
<span class="linenr"> 726: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">--------------------------------------</span>
<span class="linenr"> 727: </span>
<span class="linenr"> 728: </span><span style="color: #a626a4;">pnum10p3</span>        <span style="color: #e45649;">ldaa</span>    #$30
<span class="linenr"> 729: </span>                <span style="color: #e45649;">adda</span>    <span style="color: #50a14f;">1</span>,-y
<span class="linenr"> 730: </span>                <span style="color: #e45649;">jsr</span>     putchar
<span class="linenr"> 731: </span>                <span style="color: #e45649;">dec</span>     CTR
<span class="linenr"> 732: </span>                <span style="color: #e45649;">bne</span>     pnum10p3
<span class="linenr"> 733: </span>                <span style="color: #e45649;">ldx</span>     #NEWLINE
<span class="linenr"> 734: </span>                <span style="color: #e45649;">jsr</span>     print
<span class="linenr"> 735: </span>                <span style="color: #e45649;">puly</span>
<span class="linenr"> 736: </span>                <span style="color: #e45649;">pulx</span>
<span class="linenr"> 737: </span>                <span style="color: #e45649;">puld</span>
<span class="linenr"> 738: </span>                <span style="color: #e45649;">rts</span>
<span class="linenr"> 739: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">***********end of pnum10********************</span>
<span class="linenr"> 740: </span>
<span class="linenr"> 741: </span><span style="color: #9ca0a4;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="linenr"> 742: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">typewriter</span>
<span class="linenr"> 743: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Program:    simple echo program which sends user input back to the terminal</span>
<span class="linenr"> 744: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 745: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Input:      None</span>
<span class="linenr"> 746: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Output:     None, doesn't ever return to main loop</span>
<span class="linenr"> 747: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Algorithm:</span>
<span class="linenr"> 748: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">gets character from terminal</span>
<span class="linenr"> 749: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">sends character back to terminal.</span>
<span class="linenr"> 750: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">if newline is recieved, a linefeed is also sent to terminal</span>
<span class="linenr"> 751: </span><span style="color: #a626a4;">typewriter</span>
<span class="linenr"> 752: </span>    <span style="color: #e45649;">jsr</span>     getchar
<span class="linenr"> 753: </span>    <span style="color: #e45649;">jsr</span>     putchar
<span class="linenr"> 754: </span>
<span class="linenr"> 755: </span>    <span style="color: #e45649;">cmpa</span>    #CR
<span class="linenr"> 756: </span>    <span style="color: #e45649;">bne</span>     typewriter
<span class="linenr"> 757: </span>
<span class="linenr"> 758: </span><span style="color: #a626a4;">typewriter_onenter</span>
<span class="linenr"> 759: </span>    <span style="color: #e45649;">ldaa</span>    #LF
<span class="linenr"> 760: </span>    <span style="color: #e45649;">jsr</span>     putchar
<span class="linenr"> 761: </span>    <span style="color: #e45649;">bra</span>     typewriter
<span class="linenr"> 762: </span>
<span class="linenr"> 763: </span><span style="color: #9ca0a4;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="linenr"> 764: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">update_LEDs</span>
<span class="linenr"> 765: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Program:    convert integer to binary coded decimal, and update PORTA/PORTB with minutes and seconds.</span>
<span class="linenr"> 766: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 767: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Input:      None. uses global minutes and seconds counters</span>
<span class="linenr"> 768: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Ouput:      Modifies PORTA and PORTB</span>
<span class="linenr"> 769: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Algorithm:</span>
<span class="linenr"> 770: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">values are stored as integers. minutes is easy, just store it at PORTA</span>
<span class="linenr"> 771: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 772: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">for PORTB, first it is divided by 10. the remainder is the 1's place,</span>
<span class="linenr"> 773: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">quotient is the 10's place.</span>
<span class="linenr"> 774: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 775: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">the 1's digit is stored in the temp variable. then the 10's digit is shifted.</span>
<span class="linenr"> 776: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">they are or'ed together</span>
<span class="linenr"> 777: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">the result is stored in PORTB</span>
<span class="linenr"> 778: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 779: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #50a14f; font-weight: bold;">NOTE:</span><span style="color: #9ca0a4;"> A temp variable isn't needed, but if PORTB is used directly, then the simulator</span>
<span class="linenr"> 780: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">will flicker the seconds 10's place digit (this wouldn't be visible in real life).</span>
<span class="linenr"> 781: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">a temp variable is used soley for the simulator.</span>
<span class="linenr"> 782: </span><span style="color: #a626a4;">update_LEDs</span>
<span class="linenr"> 783: </span>    <span style="color: #e45649;">pshd</span>
<span class="linenr"> 784: </span>    <span style="color: #e45649;">pshx</span>
<span class="linenr"> 785: </span>    <span style="color: #e45649;">clr</span>     <span style="color: #50a14f;">1</span>,-SP               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">temp variable</span>
<span class="linenr"> 786: </span>
<span class="linenr"> 787: </span>    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">does the time need updated?</span>
<span class="linenr"> 788: </span>    <span style="color: #e45649;">ldd</span>     ctr2p5m             <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">check the 2.5ms counter, has 1000ms elapsed?</span>
<span class="linenr"> 789: </span>    <span style="color: #e45649;">cpd</span>     #<span style="color: #50a14f;">150</span>                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">| (ie, counter == 400)</span>
<span class="linenr"> 790: </span>    <span style="color: #e45649;">bls</span>     update_LEDs_skip    <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">| (for sim purposes, this value is set to 150)</span>
<span class="linenr"> 791: </span>
<span class="linenr"> 792: </span>    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">the counter</span>
<span class="linenr"> 793: </span>    <span style="color: #e45649;">clr</span>     ctr2p5m             <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">clear (BOTH BYTES) of the counter</span>
<span class="linenr"> 794: </span>    <span style="color: #e45649;">clr</span>     ctr2p5m+<span style="color: #50a14f;">1</span>           <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 795: </span>    <span style="color: #e45649;">inc</span>     times               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">increment the seconds counter</span>
<span class="linenr"> 796: </span>
<span class="linenr"> 797: </span>    <span style="color: #e45649;">ldaa</span>    times               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">is the seconds counter == 60?</span>
<span class="linenr"> 798: </span>    <span style="color: #e45649;">cmpa</span>    #<span style="color: #50a14f;">60</span>                 <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 799: </span>    <span style="color: #e45649;">blo</span>     update_LEDs_skip    <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 800: </span>
<span class="linenr"> 801: </span>    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">seconds counter == 60</span>
<span class="linenr"> 802: </span>    <span style="color: #e45649;">clr</span>     times               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">reset the seconds counter</span>
<span class="linenr"> 803: </span>    <span style="color: #e45649;">inc</span>     timem               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">increment the minutes counter</span>
<span class="linenr"> 804: </span>
<span class="linenr"> 805: </span>    <span style="color: #e45649;">ldaa</span>    timem               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">is the minutes counter == 10?</span>
<span class="linenr"> 806: </span>    <span style="color: #e45649;">cmpa</span>    #<span style="color: #50a14f;">10</span>                 <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 807: </span>    <span style="color: #e45649;">blo</span>     update_LEDs_skip    <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 808: </span>
<span class="linenr"> 809: </span>    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">minutes counter == 10</span>
<span class="linenr"> 810: </span>    <span style="color: #e45649;">clr</span>     timem               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">reset minutes counter back to 0</span>
<span class="linenr"> 811: </span>
<span class="linenr"> 812: </span><span style="color: #a626a4;">update_LEDs_skip</span>
<span class="linenr"> 813: </span>
<span class="linenr"> 814: </span>    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">do first divide (for 1's digit)</span>
<span class="linenr"> 815: </span>    <span style="color: #e45649;">ldab</span>    times               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">set dividend (total num of seconds)</span>
<span class="linenr"> 816: </span>    <span style="color: #e45649;">clra</span>                        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">ensure A is zero for divide</span>
<span class="linenr"> 817: </span>    <span style="color: #e45649;">ldx</span>     #<span style="color: #50a14f;">10</span>                 <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">set divisor</span>
<span class="linenr"> 818: </span>    <span style="color: #e45649;">idiv</span>
<span class="linenr"> 819: </span>
<span class="linenr"> 820: </span>    <span style="color: #e45649;">stab</span>    SP                  <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">stash 1's digit on temp variable</span>
<span class="linenr"> 821: </span>
<span class="linenr"> 822: </span>    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">10's digit is now in X register</span>
<span class="linenr"> 823: </span>    <span style="color: #e45649;">tfr</span>     X,D                 <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">move from X to D (low-4 will be in B register)</span>
<span class="linenr"> 824: </span>
<span class="linenr"> 825: </span>    <span style="color: #e45649;">lslb</span>                        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">move digit to upper four bits</span>
<span class="linenr"> 826: </span>    <span style="color: #e45649;">lslb</span>                        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 827: </span>    <span style="color: #e45649;">lslb</span>                        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 828: </span>    <span style="color: #e45649;">lslb</span>                        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 829: </span>
<span class="linenr"> 830: </span>    <span style="color: #e45649;">orab</span>    SP                  <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">combine 10's and 1's in PORTB</span>
<span class="linenr"> 831: </span>    <span style="color: #e45649;">stab</span>    PORTB               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">store value to PORTB</span>
<span class="linenr"> 832: </span>
<span class="linenr"> 833: </span>    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">send result out to ports</span>
<span class="linenr"> 834: </span>    <span style="color: #e45649;">ldaa</span>    timem
<span class="linenr"> 835: </span>    <span style="color: #e45649;">staa</span>    PORTA
<span class="linenr"> 836: </span>
<span class="linenr"> 837: </span>    <span style="color: #e45649;">leas</span>    <span style="color: #50a14f;">1</span>,SP                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">pop off temp variable</span>
<span class="linenr"> 838: </span>    <span style="color: #e45649;">pulx</span>
<span class="linenr"> 839: </span>    <span style="color: #e45649;">puld</span>
<span class="linenr"> 840: </span>    <span style="color: #e45649;">rts</span>
<span class="linenr"> 841: </span>
<span class="linenr"> 842: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">atoi</span>
<span class="linenr"> 843: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 844: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Program:    converts a string to an integer (if possible)</span>
<span class="linenr"> 845: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 846: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Input:      X Register: pointer to string</span>
<span class="linenr"> 847: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 848: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Output:     D Register: integer representation of string</span>
<span class="linenr"> 849: </span><span style="color: #9ca0a4;">;;;             </span><span style="color: #9ca0a4;">modifies err_flag and err_data</span>
<span class="linenr"> 850: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 851: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Algorithm:</span>
<span class="linenr"> 852: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">converts digits up to first non-number character.</span>
<span class="linenr"> 853: </span><span style="color: #9ca0a4;">;;;      </span><span style="color: #9ca0a4;">e.g. atoi("12hey there") -&gt; 12</span>
<span class="linenr"> 854: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 855: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">if the first character is a non-number, D is set to zero</span>
<span class="linenr"> 856: </span><span style="color: #9ca0a4;">;;;      </span><span style="color: #9ca0a4;">and err_flag and err_data are set accordingly</span>
<span class="linenr"> 857: </span><span style="color: #9ca0a4;">;;;      </span><span style="color: #9ca0a4;">e.g. atoi("afs12") -&gt; 0 (ERROR)</span>
<span class="linenr"> 858: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 859: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">Stack Layout:</span>
<span class="linenr"> 860: </span><span style="color: #9ca0a4;">;;;         </span><span style="color: #9ca0a4;">SP + 8: return address</span>
<span class="linenr"> 861: </span><span style="color: #9ca0a4;">;;;         </span><span style="color: #9ca0a4;">SP + 6: X reg</span>
<span class="linenr"> 862: </span><span style="color: #9ca0a4;">;;;         </span><span style="color: #9ca0a4;">SP + 5: len var</span>
<span class="linenr"> 863: </span><span style="color: #9ca0a4;">;;;         </span><span style="color: #9ca0a4;">SP + 4: pow var</span>
<span class="linenr"> 864: </span><span style="color: #9ca0a4;">;;;         </span><span style="color: #9ca0a4;">SP + 2: tmp var</span>
<span class="linenr"> 865: </span><span style="color: #9ca0a4;">;;;         </span><span style="color: #9ca0a4;">SP + 0: accum var</span>
<span class="linenr"> 866: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 867: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">// find length of number</span>
<span class="linenr"> 868: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">len = 0 ; length accumulator</span>
<span class="linenr"> 869: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">while is_digit((X++)*):</span>
<span class="linenr"> 870: </span><span style="color: #9ca0a4;">;;;         </span><span style="color: #9ca0a4;">len++;</span>
<span class="linenr"> 871: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 872: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">// add up each digit</span>
<span class="linenr"> 873: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">index = len; // len is now index for X</span>
<span class="linenr"> 874: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">accum = A; store A on the stack</span>
<span class="linenr"> 875: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">pow = 0; // power variable</span>
<span class="linenr"> 876: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">B = 1 ; // B is now the Power Accumulator</span>
<span class="linenr"> 877: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">X = index+X ; we are going through this number backwards</span>
<span class="linenr"> 878: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">while index &gt; 0:</span>
<span class="linenr"> 879: </span><span style="color: #9ca0a4;">;;;         </span><span style="color: #9ca0a4;">index--;</span>
<span class="linenr"> 880: </span><span style="color: #9ca0a4;">;;;         </span><span style="color: #9ca0a4;">pow = index;</span>
<span class="linenr"> 881: </span><span style="color: #9ca0a4;">;;;         </span><span style="color: #9ca0a4;">D = X[-index];</span>
<span class="linenr"> 882: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 883: </span><span style="color: #9ca0a4;">;;;         </span><span style="color: #9ca0a4;">if pow == 0:</span>
<span class="linenr"> 884: </span><span style="color: #9ca0a4;">;;;             </span><span style="color: #9ca0a4;">accum += D</span>
<span class="linenr"> 885: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 886: </span><span style="color: #9ca0a4;">;;;         </span><span style="color: #9ca0a4;">tmp = D</span>
<span class="linenr"> 887: </span><span style="color: #9ca0a4;">;;;         </span><span style="color: #9ca0a4;">while pow &gt; 0:</span>
<span class="linenr"> 888: </span><span style="color: #9ca0a4;">;;;             </span><span style="color: #9ca0a4;">tmp += tmp &lt;&lt; 3</span>
<span class="linenr"> 889: </span><span style="color: #9ca0a4;">;;;             </span><span style="color: #9ca0a4;">tmp += tmp &lt;&lt; 1</span>
<span class="linenr"> 890: </span><span style="color: #9ca0a4;">;;;             </span><span style="color: #9ca0a4;">pow--;</span>
<span class="linenr"> 891: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 892: </span><span style="color: #9ca0a4;">;;;         </span><span style="color: #9ca0a4;">accum += tmp</span>
<span class="linenr"> 893: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 894: </span><span style="color: #9ca0a4;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="linenr"> 895: </span><span style="color: #a626a4;">atoi</span>
<span class="linenr"> 896: </span>    <span style="color: #e45649;">pshy</span>
<span class="linenr"> 897: </span>    <span style="color: #e45649;">pshx</span>
<span class="linenr"> 898: </span>    <span style="color: #e45649;">clr</span>     <span style="color: #50a14f;">1</span>,-SP               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">len var / index var</span>
<span class="linenr"> 899: </span>    <span style="color: #e45649;">clr</span>     <span style="color: #50a14f;">1</span>,-SP               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">pow var</span>
<span class="linenr"> 900: </span>    <span style="color: #e45649;">clr</span>     <span style="color: #50a14f;">1</span>,-SP               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">tmp var</span>
<span class="linenr"> 901: </span>    <span style="color: #e45649;">clr</span>     <span style="color: #50a14f;">1</span>,-SP               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 902: </span>    <span style="color: #e45649;">clr</span>     <span style="color: #50a14f;">1</span>,-SP               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">accum var</span>
<span class="linenr"> 903: </span>    <span style="color: #e45649;">clr</span>     <span style="color: #50a14f;">1</span>,-SP               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 904: </span>
<span class="linenr"> 905: </span><span style="color: #a626a4;">atoi_getlen</span>
<span class="linenr"> 906: </span>    <span style="color: #e45649;">ldaa</span>    <span style="color: #50a14f;">1</span>,X+                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">get next character</span>
<span class="linenr"> 907: </span>    <span style="color: #e45649;">jsr</span>     is_dig              <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">break if character != number</span>
<span class="linenr"> 908: </span>    <span style="color: #e45649;">bne</span>     atoi_getlen_exit    <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 909: </span>
<span class="linenr"> 910: </span>    <span style="color: #e45649;">inc</span>     <span style="color: #50a14f;">5</span>,SP                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">increment length</span>
<span class="linenr"> 911: </span>    <span style="color: #e45649;">bra</span>     atoi_getlen         <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">continue</span>
<span class="linenr"> 912: </span>
<span class="linenr"> 913: </span><span style="color: #a626a4;">atoi_getlen_exit</span>
<span class="linenr"> 914: </span>    <span style="color: #e45649;">ldx</span>     <span style="color: #50a14f;">6</span>,SP                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">reload x from stack</span>
<span class="linenr"> 915: </span>    <span style="color: #e45649;">dex</span>                         <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">keep X from being incremented prematurely.</span>
<span class="linenr"> 916: </span><span style="color: #a626a4;">atoi_accumulate</span>
<span class="linenr"> 917: </span>    <span style="color: #e45649;">ldaa</span>    <span style="color: #50a14f;">5</span>,SP                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">if index == 0, break</span>
<span class="linenr"> 918: </span>    <span style="color: #e45649;">cmpa</span>    #<span style="color: #50a14f;">0</span>                  <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 919: </span>    <span style="color: #e45649;">beq</span>     atoi_exit           <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 920: </span>    <span style="color: #e45649;">dec</span>     <span style="color: #50a14f;">5</span>,SP                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">decrement index</span>
<span class="linenr"> 921: </span>    <span style="color: #e45649;">deca</span>                        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">decrement register to track</span>
<span class="linenr"> 922: </span>    <span style="color: #e45649;">inx</span>                         <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">decrement pointer</span>
<span class="linenr"> 923: </span>
<span class="linenr"> 924: </span>    <span style="color: #e45649;">movb</span>    <span style="color: #50a14f;">5</span>,SP, <span style="color: #50a14f;">4</span>,SP          <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">pow = index</span>
<span class="linenr"> 925: </span>
<span class="linenr"> 926: </span>    <span style="color: #e45649;">cmpa</span>    #<span style="color: #50a14f;">0</span>                  <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">if pow &gt; 0, skip special handling</span>
<span class="linenr"> 927: </span>    <span style="color: #e45649;">bne</span>     atoi_calc_power     <span style="color: #9ca0a4;">;</span>
<span class="linenr"> 928: </span>
<span class="linenr"> 929: </span>    <span style="color: #e45649;">clra</span>                        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">clear A register</span>
<span class="linenr"> 930: </span>    <span style="color: #e45649;">ldab</span>     X                  <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">load lower 8 bits to B</span>
<span class="linenr"> 931: </span>    <span style="color: #e45649;">subb</span>    #$30                 <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">convert from ascii</span>
<span class="linenr"> 932: </span>    <span style="color: #e45649;">addd</span>    SP                  <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">D += accum</span>
<span class="linenr"> 933: </span>    <span style="color: #e45649;">std</span>     SP                  <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">accum = D</span>
<span class="linenr"> 934: </span>    <span style="color: #e45649;">bra</span>     atoi_exit           <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">at this point, loop is finished</span>
<span class="linenr"> 935: </span>
<span class="linenr"> 936: </span>    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">because of the previous if statement, we know that index and power</span>
<span class="linenr"> 937: </span>    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">will always be at least 1</span>
<span class="linenr"> 938: </span><span style="color: #a626a4;">atoi_calc_power</span>
<span class="linenr"> 939: </span>    <span style="color: #e45649;">clra</span>
<span class="linenr"> 940: </span>    <span style="color: #e45649;">ldab</span>    X                   <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">load lower 8 bits to B</span>
<span class="linenr"> 941: </span>    <span style="color: #e45649;">subb</span>    #$30                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">convert from ascii</span>
<span class="linenr"> 942: </span>
<span class="linenr"> 943: </span>    <span style="color: #e45649;">std</span>     <span style="color: #50a14f;">2</span>,SP                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">store in tmp</span>
<span class="linenr"> 944: </span><span style="color: #a626a4;">atoi_calc_power_lp</span>
<span class="linenr"> 945: </span>    <span style="color: #e45649;">ldaa</span>    <span style="color: #50a14f;">4</span>,SP                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">if pow = 0, break</span>
<span class="linenr"> 946: </span>    <span style="color: #e45649;">cmpa</span>    #<span style="color: #50a14f;">0</span>                  <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 947: </span>    <span style="color: #e45649;">beq</span>     atoi_calc_power_exit<span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 948: </span>    <span style="color: #e45649;">dec</span>     <span style="color: #50a14f;">4</span>,SP                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">decrement pow var</span>
<span class="linenr"> 949: </span>
<span class="linenr"> 950: </span>    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">prepare for first shift</span>
<span class="linenr"> 951: </span>    <span style="color: #e45649;">ldd</span>     <span style="color: #50a14f;">2</span>,SP                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">D = tmp</span>
<span class="linenr"> 952: </span>    <span style="color: #e45649;">tfr</span>     D,Y                 <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">stash D in Y</span>
<span class="linenr"> 953: </span>
<span class="linenr"> 954: </span>    <span style="color: #e45649;">lsld</span>                        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">D *= 8</span>
<span class="linenr"> 955: </span>    <span style="color: #e45649;">lsld</span>                        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 956: </span>    <span style="color: #e45649;">lsld</span>                        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 957: </span>
<span class="linenr"> 958: </span>    <span style="color: #e45649;">std</span>     <span style="color: #50a14f;">2</span>,SP                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">tmp = D</span>
<span class="linenr"> 959: </span>
<span class="linenr"> 960: </span>    <span style="color: #9ca0a4;">;; </span><span style="color: #9ca0a4;">prepare for shift again</span>
<span class="linenr"> 961: </span>    <span style="color: #e45649;">tfr</span>     Y,D                 <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">retrieve D from Y</span>
<span class="linenr"> 962: </span>
<span class="linenr"> 963: </span>    <span style="color: #e45649;">lsld</span>                        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">D *= 2</span>
<span class="linenr"> 964: </span>
<span class="linenr"> 965: </span>    <span style="color: #e45649;">addd</span>    <span style="color: #50a14f;">2</span>,SP                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">tmp += D</span>
<span class="linenr"> 966: </span>    <span style="color: #e45649;">std</span>     <span style="color: #50a14f;">2</span>,SP                  <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 967: </span>
<span class="linenr"> 968: </span>    <span style="color: #e45649;">bra</span>     atoi_calc_power_lp
<span class="linenr"> 969: </span>
<span class="linenr"> 970: </span><span style="color: #a626a4;">atoi_calc_power_exit</span>
<span class="linenr"> 971: </span>    <span style="color: #e45649;">ldd</span>     <span style="color: #50a14f;">2</span>,SP                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">load tmp into D</span>
<span class="linenr"> 972: </span>    <span style="color: #e45649;">addd</span>    SP                  <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">add tmp to accum</span>
<span class="linenr"> 973: </span>    <span style="color: #e45649;">std</span>     SP                  <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr"> 974: </span>    <span style="color: #e45649;">bra</span>     atoi_accumulate
<span class="linenr"> 975: </span>
<span class="linenr"> 976: </span><span style="color: #a626a4;">atoi_exit</span>
<span class="linenr"> 977: </span>    <span style="color: #e45649;">ldd</span>     SP                  <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">D = accumulator</span>
<span class="linenr"> 978: </span>    <span style="color: #e45649;">leas</span>    <span style="color: #50a14f;">6</span>,SP
<span class="linenr"> 979: </span>    <span style="color: #e45649;">pulx</span>
<span class="linenr"> 980: </span>    <span style="color: #e45649;">puly</span>
<span class="linenr"> 981: </span>    <span style="color: #e45649;">rts</span>
<span class="linenr"> 982: </span><span style="color: #9ca0a4;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="linenr"> 983: </span>
<span class="linenr"> 984: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">is_dig</span>
<span class="linenr"> 985: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 986: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Program:    determines if the value in A is an ascii digit</span>
<span class="linenr"> 987: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 988: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Input:      A register: Ascii test value</span>
<span class="linenr"> 989: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 990: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Output:     Modifies Zero bit in CCR</span>
<span class="linenr"> 991: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr"> 992: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Algorithm:</span>
<span class="linenr"> 993: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">if A &lt; '0' or A &gt; '9':</span>
<span class="linenr"> 994: </span><span style="color: #9ca0a4;">;;;         </span><span style="color: #9ca0a4;">return false</span>
<span class="linenr"> 995: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">else:</span>
<span class="linenr"> 996: </span><span style="color: #9ca0a4;">;;;         </span><span style="color: #9ca0a4;">return true</span>
<span class="linenr"> 997: </span><span style="color: #9ca0a4;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="linenr"> 998: </span><span style="color: #a626a4;">is_dig</span>
<span class="linenr"> 999: </span>    <span style="color: #e45649;">cmpa</span>    #'<span style="color: #50a14f;">0</span>'                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">if A &lt; '0' or A &gt; '9' return false</span>
<span class="linenr">1000: </span>    <span style="color: #e45649;">blo</span>     is_dig_false        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr">1001: </span>    <span style="color: #e45649;">cmpa</span>    #'<span style="color: #50a14f;">9</span>'                <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr">1002: </span>    <span style="color: #e45649;">bhi</span>     is_dig_false        <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">|</span>
<span class="linenr">1003: </span>
<span class="linenr">1004: </span><span style="color: #a626a4;">is_dig_true</span>
<span class="linenr">1005: </span>    <span style="color: #e45649;">orcc</span>    #<span style="color: #6a1868;">%00000100</span>          <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">set Z bit in CCR</span>
<span class="linenr">1006: </span>    <span style="color: #e45649;">rts</span>
<span class="linenr">1007: </span>
<span class="linenr">1008: </span><span style="color: #a626a4;">is_dig_false</span>
<span class="linenr">1009: </span>    <span style="color: #e45649;">andcc</span>   #<span style="color: #6a1868;">%11111011</span>          <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">clear Z bit in CCR</span>
<span class="linenr">1010: </span>    <span style="color: #e45649;">rts</span>
<span class="linenr">1011: </span><span style="color: #9ca0a4;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="linenr">1012: </span>
<span class="linenr">1013: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">print</span>
<span class="linenr">1014: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">1015: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Program: Output character string to SCI port, print message</span>
<span class="linenr">1016: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Input:   Register X points to ASCII characters in memory</span>
<span class="linenr">1017: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Output:  message printed on the terminal connected to SCI port</span>
<span class="linenr">1018: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">1019: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Registers modified: CCR</span>
<span class="linenr">1020: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Algorithm:</span>
<span class="linenr">1021: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">Pick up 1 byte from memory where X register is pointing</span>
<span class="linenr">1022: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">Send it out to SCI port</span>
<span class="linenr">1023: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">Update X register to point to the next byte</span>
<span class="linenr">1024: </span><span style="color: #9ca0a4;">;;;     </span><span style="color: #9ca0a4;">Repeat until the byte data $00 is encountered</span>
<span class="linenr">1025: </span><span style="color: #9ca0a4;">;;;       </span><span style="color: #9ca0a4;">(String is terminated with NULL=$00)</span>
<span class="linenr">1026: </span><span style="color: #9ca0a4;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="linenr">1027: </span><span style="color: #a626a4;">print</span>
<span class="linenr">1028: </span>    <span style="color: #e45649;">psha</span>                   <span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">Save registers</span>
<span class="linenr">1029: </span>    <span style="color: #e45649;">pshx</span>
<span class="linenr">1030: </span><span style="color: #a626a4;">printmsgloop</span>
<span class="linenr">1031: </span>    <span style="color: #e45649;">ldaa</span>    <span style="color: #50a14f;">1</span>,X+           <span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">pick up an ASCII character from string</span>
<span class="linenr">1032: </span>                            <span style="color: #9ca0a4;">;   </span><span style="color: #9ca0a4;">pointed by X register</span>
<span class="linenr">1033: </span>                            <span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">then update the X register to point to</span>
<span class="linenr">1034: </span>                            <span style="color: #9ca0a4;">;   </span><span style="color: #9ca0a4;">the next byte</span>
<span class="linenr">1035: </span>    <span style="color: #e45649;">cmpa</span>    #NULL
<span class="linenr">1036: </span>    <span style="color: #e45649;">beq</span>     printmsgdone   <span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">end of strint yet?</span>
<span class="linenr">1037: </span>    <span style="color: #e45649;">jsr</span>     putchar        <span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">if not, print character and do next</span>
<span class="linenr">1038: </span>    <span style="color: #e45649;">bra</span>     printmsgloop
<span class="linenr">1039: </span>
<span class="linenr">1040: </span><span style="color: #a626a4;">printmsgdone</span>
<span class="linenr">1041: </span>    <span style="color: #e45649;">pulx</span>
<span class="linenr">1042: </span>    <span style="color: #e45649;">pula</span>
<span class="linenr">1043: </span>    <span style="color: #e45649;">rts</span>
<span class="linenr">1044: </span><span style="color: #9ca0a4;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="linenr">1045: </span>
<span class="linenr">1046: </span>
<span class="linenr">1047: </span>
<span class="linenr">1048: </span><span style="color: #9ca0a4;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="linenr">1049: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">putchar</span>
<span class="linenr">1050: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">1051: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Program: Send one character to SCI port, terminal</span>
<span class="linenr">1052: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Input:   Accumulator A contains an ASCII character, 8bit</span>
<span class="linenr">1053: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Output:  Send one character to SCI port, terminal</span>
<span class="linenr">1054: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Registers modified: CCR</span>
<span class="linenr">1055: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Algorithm:</span>
<span class="linenr">1056: </span><span style="color: #9ca0a4;">;;;    </span><span style="color: #9ca0a4;">Wait for transmit buffer become empty</span>
<span class="linenr">1057: </span><span style="color: #9ca0a4;">;;;      </span><span style="color: #9ca0a4;">Transmit buffer empty is indicated by TDRE bit</span>
<span class="linenr">1058: </span><span style="color: #9ca0a4;">;;;      </span><span style="color: #9ca0a4;">TDRE = 1 : empty - Transmit Data Register Empty, ready to transmit</span>
<span class="linenr">1059: </span><span style="color: #9ca0a4;">;;;      </span><span style="color: #9ca0a4;">TDRE = 0 : not empty, transmission in progress</span>
<span class="linenr">1060: </span><span style="color: #9ca0a4;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="linenr">1061: </span><span style="color: #a626a4;">putchar</span>
<span class="linenr">1062: </span>    <span style="color: #e45649;">brclr</span> SCISR1,#<span style="color: #6a1868;">%10000000</span>,putchar   <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">wait for transmit buffer empty</span>
<span class="linenr">1063: </span>    <span style="color: #e45649;">staa</span>  SCIDRL                      <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">send a character</span>
<span class="linenr">1064: </span>    <span style="color: #e45649;">rts</span>
<span class="linenr">1065: </span><span style="color: #9ca0a4;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="linenr">1066: </span>
<span class="linenr">1067: </span><span style="color: #9ca0a4;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="linenr">1068: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">getchar</span>
<span class="linenr">1069: </span><span style="color: #9ca0a4;">;;;</span>
<span class="linenr">1070: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Program: Input one character from SCI port (terminal/keyboard)</span>
<span class="linenr">1071: </span><span style="color: #9ca0a4;">;;;             </span><span style="color: #9ca0a4;">if a character is received, other wise return NULL</span>
<span class="linenr">1072: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Input:   none</span>
<span class="linenr">1073: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Output:  Accumulator A containing the received ASCII character</span>
<span class="linenr">1074: </span><span style="color: #9ca0a4;">;;;          </span><span style="color: #9ca0a4;">if a character is received.</span>
<span class="linenr">1075: </span><span style="color: #9ca0a4;">;;;          </span><span style="color: #9ca0a4;">Otherwise Accumulator A will contain a NULL character, $00.</span>
<span class="linenr">1076: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Registers modified: CCR</span>
<span class="linenr">1077: </span><span style="color: #9ca0a4;">;;; </span><span style="color: #9ca0a4;">Algorithm:</span>
<span class="linenr">1078: </span><span style="color: #9ca0a4;">;;;    </span><span style="color: #9ca0a4;">Check for receive buffer become full</span>
<span class="linenr">1079: </span><span style="color: #9ca0a4;">;;;      </span><span style="color: #9ca0a4;">Receive buffer full is indicated by RDRF bit</span>
<span class="linenr">1080: </span><span style="color: #9ca0a4;">;;;      </span><span style="color: #9ca0a4;">RDRF = 1 : full - Receive Data Register Full, 1 byte received</span>
<span class="linenr">1081: </span><span style="color: #9ca0a4;">;;;      </span><span style="color: #9ca0a4;">RDRF = 0 : not full, 0 byte received</span>
<span class="linenr">1082: </span><span style="color: #9ca0a4;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="linenr">1083: </span><span style="color: #a626a4;">getchar</span>
<span class="linenr">1084: </span>    <span style="color: #e45649;">brclr</span> SCISR1,#<span style="color: #6a1868;">%00100000</span>,getchar7
<span class="linenr">1085: </span>    <span style="color: #e45649;">ldaa</span>  SCIDRL
<span class="linenr">1086: </span>    <span style="color: #e45649;">rts</span>
<span class="linenr">1087: </span><span style="color: #a626a4;">getchar7</span>
<span class="linenr">1088: </span>    <span style="color: #e45649;">clra</span>
<span class="linenr">1089: </span>    <span style="color: #e45649;">rts</span>
<span class="linenr">1090: </span><span style="color: #9ca0a4;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="linenr">1091: </span>
<span class="linenr">1092: </span><span style="color: #9ca0a4;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
<span class="linenr">1093: </span><span style="color: #a626a4;">rtiisr</span>
<span class="linenr">1094: </span>    <span style="color: #e45649;">bset</span>    CRGFLG,<span style="color: #6a1868;">%10000000</span> <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">clear RTI Interrupt Flag - for the next one</span>
<span class="linenr">1095: </span>    <span style="color: #e45649;">ldx</span>     ctr2p5m          <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">every time the RTI occur, increase</span>
<span class="linenr">1096: </span>    <span style="color: #e45649;">inx</span>                      <span style="color: #9ca0a4;">;    </span><span style="color: #9ca0a4;">the 16bit interrupt count</span>
<span class="linenr">1097: </span>    <span style="color: #e45649;">stx</span>     ctr2p5m
<span class="linenr">1098: </span>    <span style="color: #e45649;">rti</span>
<span class="linenr">1099: </span>
<span class="linenr">1100: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">OPTIONAL</span>
<span class="linenr">1101: </span><span style="color: #9ca0a4;">;</span><span style="color: #9ca0a4;">more variable/data section below</span>
<span class="linenr">1102: </span><span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">this is after the program code section</span>
<span class="linenr">1103: </span><span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">of the RAM.  RAM ends at $3FFF</span>
<span class="linenr">1104: </span><span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">in MC9S12C128 chip</span>
<span class="linenr">1105: </span>
<span class="linenr">1106: </span>               <span style="color: #e45649;">END</span>               <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">this is end of assembly source file</span>
<span class="linenr">1107: </span>                                 <span style="color: #9ca0a4;">; </span><span style="color: #9ca0a4;">lines below are ignored - not assembled/compiled</span>
</pre>
</div>
</div>
</body>
</html>